[
  {
    "text" : " You",
    "endMs" : 2000,
    "startMs" : 0
  },
  {
    "startMs" : 2000,
    "endMs" : 4000,
    "text" : " You"
  },
  {
    "endMs" : 33760,
    "startMs" : 30080,
    "text" : " All right, everybody welcome to this later evening"
  },
  {
    "startMs" : 33760,
    "endMs" : 37360,
    "text" : " Livestream I'm here with my"
  },
  {
    "endMs" : 45880,
    "text" : " fearless colleague Igor Kruljic who did not have time to get back to his house before we went live to talk about",
    "startMs" : 37360
  },
  {
    "text" : " What is probably one of the most?",
    "startMs" : 45880,
    "endMs" : 49480
  },
  {
    "startMs" : 49480,
    "endMs" : 53600,
    "text" : " Significant changes and developments for the Alberta"
  },
  {
    "endMs" : 58400,
    "startMs" : 53600,
    "text" : " PNP which became the Alberta immigrant nominee program"
  },
  {
    "startMs" : 58600,
    "text" : " Which now we you know fondly recognizes the Alberta advantage immigration program",
    "endMs" : 64480
  },
  {
    "text" : " And I'll be honest for many years you guys I truly did believe that Alberta had an advantage",
    "endMs" : 70080,
    "startMs" : 64480
  },
  {
    "startMs" : 70080,
    "endMs" : 76340,
    "text" : " Why because it wasn't complicated to qualify through the Alberta opportunity stream"
  },
  {
    "text" : " but all of that has now changed and no longer is it a simple process of do I meet the eligibility for the",
    "endMs" : 85080,
    "startMs" : 76340
  },
  {
    "text" : " Alberta opportunity stream or the real renewal stream or the",
    "endMs" : 90080,
    "startMs" : 85720
  },
  {
    "startMs" : 90080,
    "endMs" : 93920,
    "text" : " Accelerated tech pathway and the list goes on now. It's"
  },
  {
    "startMs" : 93920,
    "endMs" : 95760,
    "text" : " essentially"
  },
  {
    "startMs" : 95760,
    "endMs" : 102600,
    "text" : " submit an expression of interest just like British Columbia like Saskatchewan's program like Ontario and"
  },
  {
    "startMs" : 102600,
    "endMs" : 106160,
    "text" : " Do this keep your fingers crossed"
  },
  {
    "startMs" : 106160,
    "text" : " All right, Igor. Welcome. Where are you at given the fact you weren't able to make it back to your house?",
    "endMs" : 112120
  },
  {
    "text" : " Yeah, long story short. There was a Canadian immigration lawyers association meeting today in downtown, Calgary",
    "startMs" : 112960,
    "endMs" : 119960
  },
  {
    "startMs" : 119960,
    "text" : " and I've attended the",
    "endMs" : 121960
  },
  {
    "text" : " Meeting so got to meet a lot of our colleagues got to have some wonderful chats about interesting topics",
    "endMs" : 129300,
    "startMs" : 121960
  },
  {
    "startMs" : 129300,
    "endMs" : 131120,
    "text" : " including the topics of"
  },
  {
    "text" : " business and economic development in Alberta and how immigration impacts economic",
    "endMs" : 136080,
    "startMs" : 131120
  },
  {
    "endMs" : 139200,
    "startMs" : 136080,
    "text" : " landscape in our province, so it was a"
  },
  {
    "text" : " Wonderful meeting. So thank you a lot for Sheila if someone is watching us from Sheila",
    "startMs" : 140360,
    "endMs" : 144880
  },
  {
    "text" : " So I couldn't make it home",
    "startMs" : 144880,
    "endMs" : 147840
  },
  {
    "text" : " After the end of the meeting, so I'm stuck here in downtown, Calgary",
    "endMs" : 152160,
    "startMs" : 147840
  },
  {
    "text" : " So I will probably share the views a little bit with our fellow",
    "endMs" : 156840,
    "startMs" : 152160
  },
  {
    "startMs" : 156840,
    "text" : " viewers, so this is the",
    "endMs" : 159840
  },
  {
    "startMs" : 159840,
    "endMs" : 166000,
    "text" : " This is the promenade right next to the Bow River. So that's where a lot of people"
  },
  {
    "startMs" : 166760,
    "endMs" : 170200,
    "text" : " go to spend their free time in the evening after work and"
  },
  {
    "startMs" : 170200,
    "text" : " essentially, that's the place that many people see on the pictures dreaming about coming to Alberta and",
    "endMs" : 177280
  },
  {
    "startMs" : 177280,
    "endMs" : 183600,
    "text" : " When they get here, they really enjoy spending their time. Just walking breathing the fresh air"
  },
  {
    "startMs" : 183600,
    "text" : " observing the Bow River and",
    "endMs" : 186440
  },
  {
    "endMs" : 193640,
    "text" : " Yeah, like that's a wonderful place to actually host this live stream today with you mark because I",
    "startMs" : 186440
  },
  {
    "text" : " Just look at all of those people who walk on the streets and I understand that I was one of them four years ago",
    "startMs" : 194000,
    "endMs" : 200020
  },
  {
    "startMs" : 200020,
    "endMs" : 206680,
    "text" : " But I was lucky to immigrate through the federal immigration program now many of those people who cross and pass me"
  },
  {
    "endMs" : 209240,
    "text" : " on the streets over here",
    "startMs" : 206680
  },
  {
    "text" : " They don't have that privilege of",
    "startMs" : 209240,
    "endMs" : 212440
  },
  {
    "endMs" : 217780,
    "text" : " Immigrating to the federal immigration programs and the only option for them was the Alberta opportunity stream",
    "startMs" : 212440
  },
  {
    "endMs" : 225400,
    "startMs" : 218360,
    "text" : " Now with the new changes there are chances of staying in Canada, maybe either better or maybe much worse"
  },
  {
    "endMs" : 228760,
    "startMs" : 225400,
    "text" : " So that's probably what we will be talking about today in detail"
  },
  {
    "endMs" : 231240,
    "text" : " so",
    "startMs" : 228760
  },
  {
    "text" : " Really glad to be connected from this beautiful place in here in downtown, Calgary",
    "endMs" : 235360,
    "startMs" : 231240
  },
  {
    "startMs" : 235360,
    "endMs" : 239480,
    "text" : " Excellent. Thank you Igor now. I want to just"
  },
  {
    "endMs" : 243600,
    "startMs" : 239480,
    "text" : " Mention to other people I was actually going to be at that"
  },
  {
    "endMs" : 249040,
    "text" : " Sela festivity, but unfortunately for me. Well, not unfortunately I",
    "startMs" : 244160
  },
  {
    "endMs" : 251880,
    "startMs" : 249040,
    "text" : " forgot that I have a"
  },
  {
    "endMs" : 259360,
    "text" : " Job in my church to run the activities for the young, you know eight to eleven year old boys",
    "startMs" : 251880
  },
  {
    "text" : " And so tonight we actually planned a treasure hunt and I know this is completely off topic. But hey, I don't care this",
    "startMs" : 259360,
    "endMs" : 266440
  },
  {
    "startMs" : 266440,
    "endMs" : 270120,
    "text" : " This is what we're doing. So I'll show you here"
  },
  {
    "endMs" : 274520,
    "startMs" : 270120,
    "text" : " This is what we created if it if it will appear on the screen, here we go"
  },
  {
    "text" : " So this is the treasure chest and I didn't show you what was inside which was a bunch of these gold coins that were",
    "startMs" : 274520,
    "endMs" : 280820
  },
  {
    "text" : " filled with with chocolate",
    "startMs" : 280820,
    "endMs" : 283200
  },
  {
    "endMs" : 288440,
    "startMs" : 283200,
    "text" : " And the yeah, these young little kids boy. They had a heck of a time"
  },
  {
    "text" : " We used compasses and we followed a pre-designed",
    "startMs" : 288440,
    "endMs" : 292400
  },
  {
    "text" : " treasure map complete with you know",
    "endMs" : 295840,
    "startMs" : 292400
  },
  {
    "startMs" : 296160,
    "text" : " Scrolls and and all these kinds of things and it was a lot of fun with the young little kids",
    "endMs" : 300480
  },
  {
    "startMs" : 300480,
    "endMs" : 302360,
    "text" : " So I didn't make it up to Calgary"
  },
  {
    "startMs" : 302360,
    "endMs" : 305760,
    "text" : " But in all honesty gave me a little bit more time to soak in"
  },
  {
    "endMs" : 310880,
    "startMs" : 305760,
    "text" : " everything that has been going on with the program and I know that there's been lots of people who have"
  },
  {
    "startMs" : 310880,
    "endMs" : 315520,
    "text" : " Had who've chimed in who have had thoughts on what this means for immigration in Alberta"
  },
  {
    "endMs" : 319200,
    "startMs" : 315520,
    "text" : " Igor and I are hopefully gonna be able to decipher some of this information"
  },
  {
    "startMs" : 319200,
    "endMs" : 324000,
    "text" : " I was able to attend a meeting today that I can't really talk too much about"
  },
  {
    "startMs" : 325520,
    "endMs" : 328180,
    "text" : " Regarding this new system that's gonna be rolled out"
  },
  {
    "endMs" : 336280,
    "startMs" : 328180,
    "text" : " But I did have permission to share a few things that I learned and try to dispel some of the myths associated with it. So"
  },
  {
    "startMs" : 336280,
    "endMs" : 339460,
    "text" : " Welcome everybody that's tuning in wherever you're tuning in from"
  },
  {
    "endMs" : 347040,
    "text" : " Please please post in the comments where you are listening from because we would love to see how far this is reaching",
    "startMs" : 339460
  },
  {
    "endMs" : 353080,
    "text" : " I'm curious to know how many people outside of the province of Alberta are watching what's happening here",
    "startMs" : 347040
  },
  {
    "endMs" : 360160,
    "text" : " And how many are really located here in in Alberta that this will have direct impact to?",
    "startMs" : 353080
  },
  {
    "startMs" : 360160,
    "endMs" : 365840,
    "text" : " So go ahead post your questions. We'll definitely jump in. I welcome your thoughts"
  },
  {
    "text" : " I welcome, you know, everybody's had a chance about a day to look now at the",
    "startMs" : 365840,
    "endMs" : 370200
  },
  {
    "endMs" : 377200,
    "text" : " The actual point system and in my discussions with some of the government officials earlier today",
    "startMs" : 370200
  },
  {
    "startMs" : 377200,
    "endMs" : 382140,
    "text" : " I brought up some of the comments that you know that you folks have mentioned and I can see here"
  },
  {
    "startMs" : 382140,
    "endMs" : 385360,
    "text" : " We've got a number of people all chiming in and guess where they're in"
  },
  {
    "startMs" : 385360,
    "text" : " Igor we've got hopefully not only not on the promenade. Yeah, maybe they're right behind you",
    "endMs" : 391960
  },
  {
    "text" : " They're gonna poke their head in and say hello. We do have",
    "endMs" : 395360,
    "startMs" : 391960
  },
  {
    "endMs" : 402160,
    "text" : " Petra's is in BC. We've got Zaheer in Edmonton Taj, of course in Grand Prairie and",
    "startMs" : 395360
  },
  {
    "text" : " will definitely",
    "endMs" : 404760,
    "startMs" : 402160
  },
  {
    "startMs" : 404760,
    "text" : " Giselle says good evening. I'm so far from Igor downtown Calgary. Well Igor is downtown Calgary. He sure is",
    "endMs" : 411880
  },
  {
    "text" : " We've got Marcus in Spruce Grove. We do have Alexander's tuning in from Toronto and Himal who's also in in Ontario",
    "endMs" : 419940,
    "startMs" : 412020
  },
  {
    "startMs" : 419940,
    "endMs" : 424180,
    "text" : " Turek's in Calgary Sumit's Fort Saskatchewan"
  },
  {
    "startMs" : 424180,
    "endMs" : 430300,
    "text" : " Shalia's is in Calgary. Ah, we've got Batman. He's tuning in as always"
  },
  {
    "endMs" : 435100,
    "text" : " We always have to have our superheroes make an appearance watching from Dallas, Texas",
    "startMs" : 430300
  },
  {
    "startMs" : 435100,
    "endMs" : 437620,
    "text" : " We do have okay. We've got"
  },
  {
    "endMs" : 444340,
    "text" : " Ajnab who is a Romero who's tuning in from the Philippines Nash's in Red Deer excellent",
    "startMs" : 438260
  },
  {
    "endMs" : 452220,
    "text" : " Harlow's in Hinton. This is great. We got a really really good group of people Jordan's in Edmonton cool deep car is",
    "startMs" : 444340
  },
  {
    "startMs" : 452220,
    "endMs" : 459980,
    "text" : " Core is West task one. Let's see. Yes mark from the Philippines and Ali is up in Grand Prairie"
  },
  {
    "startMs" : 459980,
    "endMs" : 463420,
    "text" : " We got multiple people from Grand Prairie. All right, so lots of"
  },
  {
    "endMs" : 465940,
    "startMs" : 463420,
    "text" : " Isaac's over in Brampton and"
  },
  {
    "startMs" : 466100,
    "endMs" : 470460,
    "text" : " John Lin's Calgary. Okay, I'm gonna need to stop there's so many people watching live here"
  },
  {
    "startMs" : 470460,
    "text" : " But we do have Lord issues tuning in from Peru. Awesome to have you",
    "endMs" : 474020
  },
  {
    "startMs" : 474020,
    "endMs" : 478340,
    "text" : " It's so great to be here and just try to share a little bit of information now"
  },
  {
    "text" : " I want your your feedback on what you think and how you feel",
    "startMs" : 478340,
    "endMs" : 482420
  },
  {
    "startMs" : 482420,
    "text" : " About these changes now that we've had about 24 hours or so to kind of digest them in our meeting today",
    "endMs" : 487900
  },
  {
    "endMs" : 494380,
    "startMs" : 487900,
    "text" : " Igor and I are going to cover a little bit about the the overview of the AI and P changes"
  },
  {
    "text" : " Then we're gonna talk about the new expression of interest system the key points",
    "startMs" : 494620,
    "endMs" : 499180
  },
  {
    "endMs" : 505780,
    "startMs" : 499180,
    "text" : " We're gonna hit on the points grid, which I know you guys are curious about what's going on here. I better get Igor in here"
  },
  {
    "startMs" : 505780,
    "text" : " I've gotten a body double here working. Just give me a second. We'll pull Igor in on here. Yes",
    "endMs" : 511740
  },
  {
    "text" : " We did it here. Yeah, I was setting this up before he joined and then he just got in like two minutes before we went live",
    "startMs" : 511740,
    "endMs" : 517980
  },
  {
    "endMs" : 521580,
    "startMs" : 517980,
    "text" : " Okay, so we've got that we're gonna talk about the points grid"
  },
  {
    "text" : " We're gonna talk about because some of the key differences from the previous system and this is important because some people are asking",
    "startMs" : 521580,
    "endMs" : 527920
  },
  {
    "startMs" : 527920,
    "endMs" : 533820,
    "text" : " Why do they you know not give any more points for people that have higher than a CLB 6?"
  },
  {
    "endMs" : 536300,
    "text" : " Why are people with more work experience?",
    "startMs" : 533820
  },
  {
    "startMs" : 536300,
    "endMs" : 543700,
    "text" : " You know all counted the same once you hit 12 months and this all ties back to the previous system and I'll explain that as we"
  },
  {
    "endMs" : 546860,
    "startMs" : 543700,
    "text" : " Go forward because I asked these questions to the officials myself"
  },
  {
    "startMs" : 547180,
    "endMs" : 554580,
    "text" : " We'll take a detailed look at the specific streams because the streams haven't disappeared just whether or not you're gonna get to apply to them"
  },
  {
    "text" : " That's what's changed",
    "endMs" : 556260,
    "startMs" : 554580
  },
  {
    "endMs" : 558260,
    "text" : " We're gonna talk about essential tips",
    "startMs" : 556260
  },
  {
    "endMs" : 564180,
    "startMs" : 558260,
    "text" : " Obviously once we give you the foundation then we're gonna talk about some essential tips that you guys need to understand when you're doing this"
  },
  {
    "text" : " And then obviously what does this mean for the future?",
    "startMs" : 564180,
    "endMs" : 568700
  },
  {
    "endMs" : 573140,
    "text" : " What do you have to take into consideration? What are the challenges you're gonna face right now?",
    "startMs" : 568700
  },
  {
    "startMs" : 574060,
    "endMs" : 579460,
    "text" : " Then obviously future outlook predictions and then we'll wrap it up with a conclusion and Q&A"
  },
  {
    "text" : " So this is kind of the roadmap of what we're gonna be talking about today. So as",
    "endMs" : 583860,
    "startMs" : 579460
  },
  {
    "startMs" : 583860,
    "endMs" : 589900,
    "text" : " An overview of the AIP changes. I want to flip over here. I should have Igor here with me"
  },
  {
    "text" : " Yes, he is. Okay, and let's adjust the screen. So it fits just a little bit better",
    "startMs" : 589900,
    "endMs" : 594180
  },
  {
    "endMs" : 599540,
    "text" : " I want to point out something that Igor worked his little tail off here our immigration blog",
    "startMs" : 594180
  },
  {
    "startMs" : 599540,
    "text" : " And if you look here, I did one on the LMI a changes about",
    "endMs" : 604580
  },
  {
    "text" : " Four or five days ago, but right here",
    "startMs" : 604580,
    "endMs" : 607500
  },
  {
    "startMs" : 607500,
    "endMs" : 612100,
    "text" : " Igor did a very comprehensive blog post on all of this"
  },
  {
    "text" : " he gave a really really good breakdown of how this all played out and",
    "endMs" : 616580,
    "startMs" : 612100
  },
  {
    "endMs" : 625140,
    "startMs" : 616580,
    "text" : " And and so I encourage you to go check out this detailed blog post that that Igor put together and there's just a ton of"
  },
  {
    "endMs" : 627020,
    "text" : " information",
    "startMs" : 625140
  },
  {
    "startMs" : 627020,
    "text" : " Just just a walk. You can see it's a nice long",
    "endMs" : 629620
  },
  {
    "text" : " Fulsome blog post with just about everything that you could you could ever imagine",
    "startMs" : 629620,
    "endMs" : 634000
  },
  {
    "endMs" : 641020,
    "startMs" : 634000,
    "text" : " So go check that out. That'll form a foundation of what we're talking about today, but just to kick things off Igor, so"
  },
  {
    "startMs" : 641020,
    "endMs" : 646640,
    "text" : " Give the viewers because I know you're only gonna be here with me for a little bit. Give them a little bit"
  },
  {
    "startMs" : 646640,
    "text" : " You know a little bit of a history about this these changes and how they came about",
    "endMs" : 651620
  },
  {
    "endMs" : 657580,
    "text" : " Yeah, so essentially we've seen an evolution of the Alberta opportunity stream and",
    "startMs" : 653220
  },
  {
    "endMs" : 666620,
    "text" : " We are the West so if for those people who are the fans of the cowboy movies, this is the wild wild West and",
    "startMs" : 657580
  },
  {
    "startMs" : 666620,
    "endMs" : 672340,
    "text" : " Things were wild in here. So everyone could apply for the provincial nomination"
  },
  {
    "endMs" : 677700,
    "startMs" : 672340,
    "text" : " Program in Alberta. There was no pretty much no restrictions, right?"
  },
  {
    "text" : " So if you meet the minimum eligibility criteria submit your application and then your application will be processed. Yes the a u.s",
    "startMs" : 677700,
    "endMs" : 685620
  },
  {
    "startMs" : 685620,
    "text" : " for example had a",
    "endMs" : 688100
  },
  {
    "endMs" : 690060,
    "startMs" : 688100,
    "text" : " disclaimer saying that"
  },
  {
    "endMs" : 697620,
    "text" : " The submission of the application does not guarantee that the province will process it. It's just mere expression of interest",
    "startMs" : 690060
  },
  {
    "startMs" : 697620,
    "endMs" : 702860,
    "text" : " so province was under no obligation to do anything with your application even if you pay the fee and"
  },
  {
    "text" : " So essentially it was possible that you could submit an application and it would be pending for months and months and you would not hear",
    "startMs" : 703180,
    "endMs" : 709820
  },
  {
    "text" : " Back, but in practice did we hear about stories of people who submitted their application and waited for years?",
    "startMs" : 709820,
    "endMs" : 715860
  },
  {
    "text" : " Probably no at least not in our firm",
    "endMs" : 718940,
    "startMs" : 715860
  },
  {
    "endMs" : 723420,
    "startMs" : 718940,
    "text" : " So essentially the idea was as long as you meet the criteria"
  },
  {
    "startMs" : 723420,
    "endMs" : 727180,
    "text" : " Submit an application. We're gonna process it then"
  },
  {
    "endMs" : 731740,
    "text" : " We had the war in Ukraine a lot of Ukrainians came over",
    "startMs" : 727180
  },
  {
    "endMs" : 739700,
    "text" : " When many of them started considering where do they go? Do they go to Alberta? Do they go to Toronto or Vancouver and",
    "startMs" : 732540
  },
  {
    "startMs" : 739700,
    "endMs" : 745260,
    "text" : " Those were the same questions that every other immigrants would pose before them, right?"
  },
  {
    "endMs" : 751180,
    "startMs" : 745260,
    "text" : " Like where do they go to study would they go to Toronto where the OMP is just ridiculous"
  },
  {
    "text" : " The competition is crazy",
    "endMs" : 753780,
    "startMs" : 751180
  },
  {
    "text" : " the requirements for the employer are just over-the-top would they go to the",
    "startMs" : 753780,
    "endMs" : 758320
  },
  {
    "text" : " British Columbia where the employer must register with the province and",
    "startMs" : 758320,
    "endMs" : 761820
  },
  {
    "text" : " The restrictions are even harder than in Alberta right now. So Alberta was this",
    "endMs" : 766780,
    "startMs" : 762380
  },
  {
    "startMs" : 766780,
    "text" : " Wild West where people would go just to",
    "endMs" : 770260
  },
  {
    "endMs" : 776540,
    "text" : " benefit from this most liberal provincial nominee program, even though we are a conservative province and",
    "startMs" : 770260
  },
  {
    "startMs" : 776540,
    "endMs" : 779660,
    "text" : " Essentially the province had to fix something"
  },
  {
    "startMs" : 779660,
    "text" : " So they they had this huge influx of the applications and they understood that they could not process everyone the province",
    "endMs" : 786300
  },
  {
    "text" : " gets only a certain number of",
    "endMs" : 788660,
    "startMs" : 786300
  },
  {
    "endMs" : 795460,
    "text" : " of nominations that they can issue per year and the federal government determines how many",
    "startMs" : 789860
  },
  {
    "endMs" : 801740,
    "startMs" : 795460,
    "text" : " Nominations the province can extend in a year. And so with the huge spike in the population"
  },
  {
    "text" : " So right now just Calgary alone is 1.6 million people. So that's the fourth largest city in Canada",
    "startMs" : 801740,
    "endMs" : 808420
  },
  {
    "endMs" : 813880,
    "text" : " 39% of Calgary population identified themselves as minorities",
    "startMs" : 808420
  },
  {
    "endMs" : 821180,
    "text" : " so that's just the statistics that I'm pulling in from today's meeting and SILA right where we talked about the economic development in Alberta and",
    "startMs" : 813900
  },
  {
    "endMs" : 827180,
    "startMs" : 821180,
    "text" : " Essentially Alberta figure out like Alberta is not made of rubber right? It cannot shrink and extend"
  },
  {
    "endMs" : 832700,
    "text" : " Indefinitely and so they had to figure out the way how to restrict those people who could submit their applications",
    "startMs" : 827180
  },
  {
    "text" : " So they decided to put a pause on the intake in February and then they announced that",
    "startMs" : 832700,
    "endMs" : 839340
  },
  {
    "startMs" : 840020,
    "endMs" : 845180,
    "text" : " Starting June, they will be conducting only certain number"
  },
  {
    "startMs" : 845180,
    "endMs" : 849220,
    "text" : " They will be taking in only a certain number of the applications"
  },
  {
    "text" : " I think it's about 430 applications for the Alberta opportunity stream and they would open the intake just one month one day in a month",
    "startMs" : 849220,
    "endMs" : 857800
  },
  {
    "startMs" : 857800,
    "endMs" : 861740,
    "text" : " Essentially what that created was the race to file system"
  },
  {
    "startMs" : 861740,
    "endMs" : 868780,
    "text" : " So you have thousands and tens of thousands of people sitting on the Alberta opportunity website all at once"
  },
  {
    "startMs" : 869300,
    "text" : " Clicking their refresh button and all crashing the websites at once and the website would be dead for hours and hours",
    "endMs" : 877220
  },
  {
    "text" : " some people would get in and we're lucky to submit their application, but",
    "startMs" : 877220,
    "endMs" : 882160
  },
  {
    "text" : " essentially, it was just a",
    "endMs" : 885020,
    "startMs" : 882160
  },
  {
    "endMs" : 891180,
    "text" : " it was a debacle right we wrote the whole blog post talking about the technical challenges and the",
    "startMs" : 885020
  },
  {
    "text" : " Disadvantages of this race to file system and people felt that the system is not fair",
    "endMs" : 896660,
    "startMs" : 891180
  },
  {
    "text" : " Some applicants would have 10 computers trying to get in some some people would not have access to reliable internet",
    "endMs" : 904780,
    "startMs" : 897940
  },
  {
    "startMs" : 904780,
    "endMs" : 911140,
    "text" : " It was not fair and the province also understood it. They had consultations with lawyers. They had consultations with"
  },
  {
    "startMs" : 911140,
    "text" : " Stakeholders and they had to fix it and then they decided to pause the intake again and they",
    "endMs" : 916780
  },
  {
    "startMs" : 916780,
    "endMs" : 920980,
    "text" : " Jump in here Igor. I'll jump in here quick. So so over the years"
  },
  {
    "startMs" : 920980,
    "endMs" : 923340,
    "text" : " I've been heavily involved with the Canadian Bar Association"
  },
  {
    "text" : " And one of the things that we do is we advocate on behalf of all of you",
    "startMs" : 923340,
    "endMs" : 927620
  },
  {
    "endMs" : 935060,
    "startMs" : 927620,
    "text" : " We you know, it's all a volunteer kind of role. I served on the the South Alberta section CBA"
  },
  {
    "startMs" : 935060,
    "endMs" : 941020,
    "text" : " I was the chair for the South Alberta section and I I got involved in the national executive and I worked my way through and"
  },
  {
    "startMs" : 941020,
    "endMs" : 946940,
    "text" : " I was a national chair of the Canadian Bar Association and much of what we did was to advocate on behalf of you"
  },
  {
    "endMs" : 952780,
    "startMs" : 946940,
    "text" : " So sometimes the government will roll out programs or do things that they just don't do what the government thinks"
  },
  {
    "endMs" : 959780,
    "startMs" : 952780,
    "text" : " They're gonna do or they create some unfairness or injustice to a certain segment of the applicants or they're just not"
  },
  {
    "text" : " It's it's not",
    "startMs" : 959780,
    "endMs" : 961540
  },
  {
    "text" : " accomplishing the design that it was really designed to do because they weren't aware of something that was happening on the ground because the government",
    "startMs" : 961540,
    "endMs" : 967460
  },
  {
    "text" : " officials don't see necessarily what you're",
    "startMs" : 967460,
    "endMs" : 970100
  },
  {
    "text" : " Experiencing on your end of say even the new portal that they've created and so the expression of interest portal",
    "endMs" : 977220,
    "startMs" : 970100
  },
  {
    "endMs" : 979220,
    "startMs" : 977220,
    "text" : " so they don't know so ultimately"
  },
  {
    "startMs" : 980020,
    "text" : " That the a bunch of lawyers within our Canadian Bar Association",
    "endMs" : 984140
  },
  {
    "startMs" : 984140,
    "endMs" : 991060,
    "text" : " were able to connect with the Alberta advantage immigration program in the summer after the race to file started and"
  },
  {
    "text" : " We're able to organize a meeting with them and say hey you need to be aware of this people",
    "endMs" : 995740,
    "startMs" : 991060
  },
  {
    "endMs" : 1002600,
    "text" : " Blocking spots and trying to sell them you need to be aware of the problems with the technology that some people are experiencing",
    "startMs" : 995740
  },
  {
    "endMs" : 1008300,
    "startMs" : 1002600,
    "text" : " This race to file is not accomplishing what you need to do and my recommendation to them was you need to pause it"
  },
  {
    "startMs" : 1008620,
    "text" : " Lots of people are like no, no, no, don't pause, but they needed to pause it",
    "endMs" : 1012100
  },
  {
    "text" : " They needed to figure something out and kudos to the Alberta advantage immigration program because in a relatively short period of time",
    "startMs" : 1012100,
    "endMs" : 1017980
  },
  {
    "startMs" : 1017980,
    "text" : " They whipped off a new expression of interest portal",
    "endMs" : 1020420
  },
  {
    "startMs" : 1020420,
    "endMs" : 1024460,
    "text" : " I'd love to see IRCC turn around with the millions of dollars that they've given"
  },
  {
    "startMs" : 1024460,
    "text" : " You know to the department from our tax dollars to develop a system. That is really it's quite effective",
    "endMs" : 1032700
  },
  {
    "startMs" : 1032700,
    "endMs" : 1036340,
    "text" : " So we'll see you guys will all see on September 30th what it looks like"
  },
  {
    "text" : " But I'm really impressed really impressed. So at the end of the day",
    "endMs" : 1039940,
    "startMs" : 1036860
  },
  {
    "text" : " We had a very positive discussions with the province and they agreed to pause it and I said to them look",
    "startMs" : 1039940,
    "endMs" : 1046140
  },
  {
    "endMs" : 1048500,
    "text" : " You're not reinventing the wheel here",
    "startMs" : 1046140
  },
  {
    "text" : " British Columbia and Ontario and other provinces have consistently had more people",
    "startMs" : 1048500,
    "endMs" : 1052860
  },
  {
    "startMs" : 1052860,
    "endMs" : 1055100,
    "text" : " You know that want to apply than their spots"
  },
  {
    "text" : " And so the only fair way to do it is through some form of point system that targets",
    "startMs" : 1055100,
    "endMs" : 1060740
  },
  {
    "startMs" : 1060740,
    "endMs" : 1066340,
    "text" : " Individuals that the province really needs at least the ones that they feel are a priority and this is the one thing"
  },
  {
    "startMs" : 1066540,
    "text" : " That that we will get to in just a little bit",
    "endMs" : 1068860
  },
  {
    "text" : " So stay tuned and I will answer why the grid is the way it is",
    "startMs" : 1068860,
    "endMs" : 1073380
  },
  {
    "text" : " When if you just look at it, it doesn't doesn't make sense. So",
    "startMs" : 1073380,
    "endMs" : 1077380
  },
  {
    "endMs" : 1083700,
    "startMs" : 1077380,
    "text" : " Yes, so once again the province decided, okay, we're gonna pause it. We're gonna make changes. So flipping it back to you Igor"
  },
  {
    "startMs" : 1083700,
    "text" : " So after the race, yeah, then we're kind of August 7th comes",
    "endMs" : 1087460
  },
  {
    "text" : " yeah, August 7 comes and on August 7th, they announced that from now on the",
    "startMs" : 1087460,
    "endMs" : 1092860
  },
  {
    "startMs" : 1093380,
    "text" : " Alberta Advantage immigration program as we know it will cease to exist at least for some time so they will pause all intake",
    "endMs" : 1100260
  },
  {
    "text" : " All intakes for at least until September 30th",
    "startMs" : 1100260,
    "endMs" : 1104100
  },
  {
    "text" : " And so as we approach September 30th, obviously more details become known and on",
    "startMs" : 1104100,
    "endMs" : 1110060
  },
  {
    "text" : " September 23rd just yesterday Alberta Opportunity Street, Alberta Advantage immigration program. Forgive me",
    "startMs" : 1110060,
    "endMs" : 1116080
  },
  {
    "endMs" : 1120780,
    "startMs" : 1116080,
    "text" : " released their points grid system breakdown and"
  },
  {
    "endMs" : 1128400,
    "text" : " They explained how they will assign points to all candidates and mark you actually raised a really important",
    "startMs" : 1121860
  },
  {
    "startMs" : 1128400,
    "endMs" : 1135140,
    "text" : " Aspect here that with the previous versions of the Alberta Advantage immigration program"
  },
  {
    "startMs" : 1135140,
    "text" : " specifically Alberta Opportunity Stream the province would get",
    "endMs" : 1138980
  },
  {
    "endMs" : 1147500,
    "text" : " thousands of applications from people working in industries or occupations that the province was not really looking for it is",
    "startMs" : 1138980
  },
  {
    "text" : " Sort of resembled what you had with the expert century system when as long as you had the minimum requirements",
    "startMs" : 1147500,
    "endMs" : 1154140
  },
  {
    "endMs" : 1157200,
    "startMs" : 1154140,
    "text" : " You can submit an application right but for the expert century"
  },
  {
    "startMs" : 1157200,
    "endMs" : 1160980,
    "text" : " stream for the expert century program"
  },
  {
    "text" : " Expert century system based programs. I'm sorry",
    "startMs" : 1160980,
    "endMs" : 1165080
  },
  {
    "endMs" : 1173860,
    "startMs" : 1165080,
    "text" : " You had to be working in a skilled occupation. So that was the minimum requirement for your job here in Alberta as long as you"
  },
  {
    "startMs" : 1175860,
    "endMs" : 1183840,
    "text" : " Don't work on the list of ineligible occupations you could apply and so that created a massive problem for the for the province and"
  },
  {
    "startMs" : 1183840,
    "endMs" : 1192800,
    "text" : " With this rollout of the new expression of interest they they solve this problem like it's not on the surface, but they actually do"
  },
  {
    "text" : " essentially they will now be in control of who they want to see in the pool of applicants and",
    "startMs" : 1192800,
    "endMs" : 1199140
  },
  {
    "text" : " Like they will have the pool of candidates and the pool of applicants. So don't confuse those two things",
    "endMs" : 1204380,
    "startMs" : 1199140
  },
  {
    "text" : " so mark, I will probably then give the floor back to you because",
    "startMs" : 1204740,
    "endMs" : 1208180
  },
  {
    "text" : " You will be leading the agenda. I'm just yeah. No. No, that's fine. Igor. Thank you. That's exactly where we're at",
    "startMs" : 1208180,
    "endMs" : 1215180
  },
  {
    "text" : " So yeah, so in my meeting earlier today, we talked about some of these issues",
    "startMs" : 1215180,
    "endMs" : 1218900
  },
  {
    "startMs" : 1218900,
    "text" : " And so those of you who have been watching we're able to see that on the government website on their updates page",
    "endMs" : 1224500
  },
  {
    "text" : " They gave a very very quick overview of what was to come not a lot of detail",
    "startMs" : 1224500,
    "endMs" : 1228980
  },
  {
    "endMs" : 1235580,
    "text" : " But enough at least to hit the high points and the high points is the worker express",
    "startMs" : 1229060
  },
  {
    "startMs" : 1235580,
    "endMs" : 1242700,
    "text" : " Expression of interest points grid and if you look here, you'll see that there's no fee obviously for submitting an expression of interest"
  },
  {
    "text" : " So anybody can submit whatever they want and one thing I want to point out that people sometimes don't understand",
    "startMs" : 1242700,
    "endMs" : 1247920
  },
  {
    "endMs" : 1256300,
    "text" : " Candidates will self-declare information about themselves when you complete this when you complete and you go into the new",
    "startMs" : 1247920
  },
  {
    "text" : " online worker expression of interest form in the portal and I'll just point out here just at the end if you have not yet and",
    "endMs" : 1265140,
    "startMs" : 1257500
  },
  {
    "text" : " This is I'm jumping ahead a little bit here. We're not keeping any secrets",
    "endMs" : 1269180,
    "startMs" : 1265140
  },
  {
    "startMs" : 1269180,
    "endMs" : 1275200,
    "text" : " You want to make sure that you have your Alberta CA account set up. But as you go through this you will see"
  },
  {
    "text" : " that",
    "endMs" : 1277260,
    "startMs" : 1275200
  },
  {
    "startMs" : 1277260,
    "endMs" : 1279660,
    "text" : " that there is no purpose and"
  },
  {
    "text" : " Really no advantage to racing as fast as you can to get your expression of interest in",
    "endMs" : 1285100,
    "startMs" : 1279660
  },
  {
    "text" : " So we know that they're gonna allow a number of intakes and we'll we read about this a little bit later",
    "startMs" : 1285340,
    "endMs" : 1290340
  },
  {
    "endMs" : 1292340,
    "startMs" : 1290340,
    "text" : " You can see here no rush to submit"
  },
  {
    "startMs" : 1292340,
    "text" : " They likely won't conduct their first pool until mid or late October",
    "endMs" : 1296580
  },
  {
    "endMs" : 1302700,
    "text" : " If you go and you take a look at this closer, you can kind of figure out what might be coming for October",
    "startMs" : 1296580
  },
  {
    "endMs" : 1304660,
    "startMs" : 1302700,
    "text" : " It's not rocket science"
  },
  {
    "startMs" : 1304660,
    "endMs" : 1309860,
    "text" : " Some of the if you look at the allocations and I know I'm jumping all over the place, but whatever"
  },
  {
    "text" : " Sometimes things just one thing flows into another but some people are asking well, what are they gonna do?",
    "endMs" : 1316180,
    "startMs" : 1310700
  },
  {
    "endMs" : 1317980,
    "text" : " Are they gonna do an Albert opportunity stream?",
    "startMs" : 1316180
  },
  {
    "endMs" : 1323500,
    "text" : " are they gonna do other areas like which which one is going to be the first one that they announce and",
    "startMs" : 1317980
  },
  {
    "text" : " So if you look at this and you look at the number of spots total number of nominations issued",
    "startMs" : 1323500,
    "endMs" : 1329540
  },
  {
    "startMs" : 1329540,
    "text" : " Okay, so we know for the Albert opportunity stream. They've already issued over four thousand",
    "endMs" : 1333900
  },
  {
    "startMs" : 1333900,
    "text" : " They have the availability of about five thousand three hundred and ninety three if you go down and you see here",
    "endMs" : 1339900
  },
  {
    "endMs" : 1346140,
    "text" : " How many are actually unprocessed or still in the queue? We have two thousand four hundred and fifty five",
    "startMs" : 1339980
  },
  {
    "endMs" : 1348220,
    "text" : " So what does that mean?",
    "startMs" : 1346140
  },
  {
    "startMs" : 1348220,
    "endMs" : 1353460,
    "text" : " That means that they already have enough before they even start to fill the AOS stream"
  },
  {
    "startMs" : 1353460,
    "text" : " So those of you who are thinking okay, we're gonna have you know",
    "endMs" : 1356660
  },
  {
    "startMs" : 1356660,
    "endMs" : 1360060,
    "text" : " These big streams and draws and and we're gonna be raring to go"
  },
  {
    "text" : " Well, don't hold your breath too quickly because it's unlikely they're gonna do an AOS right away",
    "startMs" : 1360060,
    "endMs" : 1366080
  },
  {
    "endMs" : 1372300,
    "startMs" : 1366080,
    "text" : " I suspect that they're probably gonna look to one of the other streams if you look at look at tourism and hospitality stream"
  },
  {
    "startMs" : 1372300,
    "text" : " Okay, how many applications are in the queue? Do you guys see that eight eight as of like two months ago?",
    "endMs" : 1379140
  },
  {
    "startMs" : 1379140,
    "endMs" : 1384340,
    "text" : " I guess yeah over two months ago, July 9th, 2024. That's the date that they sorry"
  },
  {
    "endMs" : 1386700,
    "startMs" : 1384340,
    "text" : " That's the date that people were submitting applications"
  },
  {
    "endMs" : 1388620,
    "startMs" : 1386700,
    "text" : " So basically this is almost in real time"
  },
  {
    "startMs" : 1388620,
    "endMs" : 1395860,
    "text" : " So eight and if you go back up here and you can see tourism and hospitality this 392 that have already been processed"
  },
  {
    "text" : " so for this year",
    "endMs" : 1397860,
    "startMs" : 1395860
  },
  {
    "startMs" : 1397860,
    "endMs" : 1401080,
    "text" : " It sure looks like there's room for this one, right?"
  },
  {
    "text" : " And if you look at the row renewal stream, you can see there's thirteen hundred ninety four process",
    "startMs" : 1401080,
    "endMs" : 1405520
  },
  {
    "text" : " They only have nineteen hundred and if you scroll down here, you can see there's well over that many already in the pool",
    "endMs" : 1411540,
    "startMs" : 1405520
  },
  {
    "text" : " So what I'm trying to get at with all of this is that they will start their their rounds for sure",
    "endMs" : 1418240,
    "startMs" : 1411540
  },
  {
    "endMs" : 1420440,
    "text" : " I'll just jump back to the main announcement here",
    "startMs" : 1418240
  },
  {
    "text" : " They will start this but I suspect it's probably going to start with the the streams where they have not filled their quotas",
    "startMs" : 1420440,
    "endMs" : 1427700
  },
  {
    "text" : " So watch for that. So yes get your expression of interest in quickly like do it, but it's not a race",
    "endMs" : 1433940,
    "startMs" : 1427700
  },
  {
    "startMs" : 1433940,
    "endMs" : 1440500,
    "text" : " So do it right and the other thing candidates will self-declare information about themselves. What does that mean?"
  },
  {
    "text" : " Well, you guys know the expression of interest and I'll just jump over here",
    "endMs" : 1444740,
    "startMs" : 1440500
  },
  {
    "endMs" : 1448520,
    "startMs" : 1444740,
    "text" : " You know that the expression the express entry process when you create your profile"
  },
  {
    "startMs" : 1448520,
    "text" : " You actually have to have a language number",
    "endMs" : 1450520
  },
  {
    "endMs" : 1454060,
    "startMs" : 1450520,
    "text" : " Associate like a details about the language tests"
  },
  {
    "startMs" : 1454060,
    "endMs" : 1458860,
    "text" : " You need to have your educational credential assessments the numbers the dates all those things and if you don't have them"
  },
  {
    "text" : " You're not going to be able to submit. Well, I can tell you guys that the expression of interest system right now",
    "startMs" : 1458860,
    "endMs" : 1463520
  },
  {
    "startMs" : 1463520,
    "endMs" : 1466160,
    "text" : " We will see how it rolls out"
  },
  {
    "startMs" : 1466160,
    "text" : " But when they say self-declare information, it's it's possible that people could",
    "endMs" : 1472060
  },
  {
    "endMs" : 1476420,
    "startMs" : 1472060,
    "text" : " Put in fake information and get an expression of interest"
  },
  {
    "startMs" : 1477060,
    "endMs" : 1481080,
    "text" : " But my goodness, you better be able to support everything that you put in there"
  },
  {
    "endMs" : 1487920,
    "startMs" : 1481080,
    "text" : " the province of Alberta has much more time to look at these applications than IRCC and"
  },
  {
    "startMs" : 1487920,
    "text" : " If you put anything in your expression of interest and I'll jump back here that isn't true in your attempt to self-declare",
    "endMs" : 1493980
  },
  {
    "startMs" : 1493980,
    "text" : " Let's say for example Igor, I'll give an example for people who are watching",
    "endMs" : 1497180
  },
  {
    "startMs" : 1497180,
    "endMs" : 1501440,
    "text" : " Let's say you have not yet had a chance to write your language test"
  },
  {
    "startMs" : 1501440,
    "endMs" : 1506840,
    "text" : " But you want to get your application in right away on September 30th when it opens up"
  },
  {
    "startMs" : 1507060,
    "endMs" : 1511600,
    "text" : " So you say well, I only need I'll just jump all over the place here. Why not?"
  },
  {
    "endMs" : 1519060,
    "text" : " I only need for example with my friend my language. I only need a 6 CLB 6 or higher. That's it",
    "startMs" : 1511600
  },
  {
    "endMs" : 1525400,
    "text" : " Well, I know I'm gonna score higher than that or someone for instance who has a language test that's expired",
    "startMs" : 1519060
  },
  {
    "endMs" : 1528840,
    "text" : " You you do not want to just put yeah",
    "startMs" : 1525400
  },
  {
    "endMs" : 1530440,
    "text" : " I've got a 6 do you what I mean?",
    "startMs" : 1528840
  },
  {
    "endMs" : 1533640,
    "startMs" : 1530440,
    "text" : " Because they don't care they don't care if it's any higher than this"
  },
  {
    "endMs" : 1538460,
    "startMs" : 1533640,
    "text" : " They don't all they care is that it's 6 or higher. I'll explain in a little bit why that is"
  },
  {
    "endMs" : 1544980,
    "startMs" : 1538460,
    "text" : " But ultimately the the thing to remember here is that the province has a lot of time to look at this and if you if they"
  },
  {
    "endMs" : 1548340,
    "text" : " Look like you're maybe not doing things properly or you know",
    "startMs" : 1544980
  },
  {
    "startMs" : 1548340,
    "endMs" : 1552680,
    "text" : " You're you're just putting down the CLB 6 and then writing the test quick and hoping you can catch it up"
  },
  {
    "text" : " Mm-hmm. Do not do that",
    "startMs" : 1552680,
    "endMs" : 1555200
  },
  {
    "startMs" : 1555200,
    "endMs" : 1559200,
    "text" : " They will see they will identify and they'll shut you down. Yeah"
  },
  {
    "endMs" : 1567560,
    "startMs" : 1559840,
    "text" : " It's a little bit easier to guess your scores on your language test, but it's a little more complicated to guess the language test"
  },
  {
    "endMs" : 1571020,
    "text" : " report form number so",
    "startMs" : 1567560
  },
  {
    "endMs" : 1575240,
    "text" : " Essentially, we've seen this in extra century applications",
    "startMs" : 1571020
  },
  {
    "endMs" : 1582960,
    "text" : " but clients would put fake test report number just to be able to create a profile and then the officer at",
    "startMs" : 1575240
  },
  {
    "startMs" : 1583420,
    "endMs" : 1590140,
    "text" : " The EAPR stage would ask for that original test report form and the applicant would not be able to produce that"
  },
  {
    "text" : " so the officer would rightfully suspect that the applicant misrepresented and",
    "endMs" : 1594620,
    "startMs" : 1590140
  },
  {
    "startMs" : 1594620,
    "endMs" : 1600140,
    "text" : " you just don't want to come up with fake information because that would be misrepresentation with all the"
  },
  {
    "startMs" : 1600140,
    "endMs" : 1605500,
    "text" : " Consequences that I don't even want to talk about here just to not the ruin the the yeah"
  },
  {
    "startMs" : 1605500,
    "endMs" : 1608220,
    "text" : " The good atmosphere of this life. Yeah"
  },
  {
    "startMs" : 1608540,
    "endMs" : 1613380,
    "text" : " Well, this is that's a good point Igor and what I want people to understand is the expression of interest"
  },
  {
    "startMs" : 1613380,
    "text" : " You know that like whatever you put in there",
    "endMs" : 1616980
  },
  {
    "startMs" : 1616980,
    "endMs" : 1624020,
    "text" : " You're gonna have to support it with documentation and one thing I know is that they went as quickly as they could"
  },
  {
    "startMs" : 1624020,
    "endMs" : 1631060,
    "text" : " To generate something so that they could keep the applications coming. So is this expression of interest portal?"
  },
  {
    "startMs" : 1631060,
    "endMs" : 1633660,
    "text" : " Is it is it a finished product? No"
  },
  {
    "endMs" : 1640760,
    "startMs" : 1634160,
    "text" : " Okay, it's kind of one of those MVPs minimum viable product and is there doing all they can to kind of get it rolled out?"
  },
  {
    "endMs" : 1646540,
    "text" : " Which I'm really impressed with with how well they did really compared to the debacle of IRCC",
    "startMs" : 1640760
  },
  {
    "text" : " Like I think about the the h-1b open work permit holder application process. Oh my goodness. What what a disaster",
    "endMs" : 1653560,
    "startMs" : 1646540
  },
  {
    "startMs" : 1653560,
    "endMs" : 1659400,
    "text" : " Those of you who went through that or were involved in it. It was just a mess, but I was really impressed"
  },
  {
    "startMs" : 1661640,
    "text" : " Excuse me, so it may be that they don't even ask for numbers it may be I don't know and",
    "endMs" : 1666680
  },
  {
    "text" : " But the reality is because they they don't really care and if you think Igor in the other applications for AOS",
    "endMs" : 1674000,
    "startMs" : 1666680
  },
  {
    "startMs" : 1674000,
    "endMs" : 1682200,
    "text" : " They didn't ask for actual numbers. I don't think I think all they asked was if you had it and then you uploaded it as"
  },
  {
    "text" : " A part of your application you can maybe think but I'm not sure if they even asked like IRCC does for the actual form number",
    "endMs" : 1689640,
    "startMs" : 1682200
  },
  {
    "text" : " I think it was just have you written a language test?",
    "startMs" : 1689640,
    "endMs" : 1692360
  },
  {
    "text" : " And I think basically what what I got from my meeting today and obviously none of the confidential stuff",
    "startMs" : 1692360,
    "endMs" : 1699680
  },
  {
    "endMs" : 1701680,
    "startMs" : 1699680,
    "text" : " That was that was shown"
  },
  {
    "startMs" : 1701680,
    "endMs" : 1708800,
    "text" : " Like will I talk about but but one of the messages that they did get acrossed is that that"
  },
  {
    "text" : " You know, it's possible people could enter answers in that would otherwise make them ineligible for programs",
    "startMs" : 1708800,
    "endMs" : 1715600
  },
  {
    "endMs" : 1720960,
    "startMs" : 1715920,
    "text" : " But it wouldn't stop them from completing at this stage. Anyways, the entire"
  },
  {
    "text" : " expression of interest in submitting it and",
    "endMs" : 1723680,
    "startMs" : 1720960
  },
  {
    "text" : " it was interesting because",
    "startMs" : 1723680,
    "endMs" : 1726040
  },
  {
    "text" : " One of the things that people are so fixated and I know people already have questions and I'll answer this",
    "endMs" : 1731000,
    "startMs" : 1726040
  },
  {
    "text" : " Indirectly, but if you look at the point system right here",
    "startMs" : 1731000,
    "endMs" : 1735080
  },
  {
    "text" : " many of the other provinces it's it's live or die by these points and",
    "startMs" : 1735080,
    "endMs" : 1741320
  },
  {
    "startMs" : 1741880,
    "text" : " Whoever has the highest point threshold is is, you know, basically, they're the ones that are going to to succeed",
    "endMs" : 1749240
  },
  {
    "startMs" : 1749240,
    "endMs" : 1755640,
    "text" : " but one of the things that was made abundantly clear to me is that the province when they do these"
  },
  {
    "startMs" : 1755640,
    "endMs" : 1764000,
    "text" : " these expression of interest this points are only one factor in their decision to extend a"
  },
  {
    "endMs" : 1772320,
    "text" : " Notification of interest well to extend like a yeah a notification of interest or an invitation whatever they're gonna call it",
    "startMs" : 1764960
  },
  {
    "endMs" : 1780400,
    "startMs" : 1772320,
    "text" : " To a person the points are only one factor you guys so you could technically have a hundred points and"
  },
  {
    "startMs" : 1780400,
    "endMs" : 1787100,
    "text" : " They not nominate you or give you an invitation to to apply to one of the programs"
  },
  {
    "startMs" : 1787100,
    "endMs" : 1792560,
    "text" : " So do not get so hung up on here and I know in their discussions"
  },
  {
    "endMs" : 1796320,
    "text" : " They talk about a number of things and we'll we'll kind of zip through this kind of quick",
    "startMs" : 1792560
  },
  {
    "text" : " But that's at a very high level",
    "endMs" : 1798600,
    "startMs" : 1796320
  },
  {
    "endMs" : 1803240,
    "text" : " That's what I want to to just reiterate is that the points are not the be-all and end-all",
    "startMs" : 1798600
  },
  {
    "startMs" : 1803240,
    "endMs" : 1808840,
    "text" : " So and mark we can probably even compare this to experts entry in very"
  },
  {
    "endMs" : 1816720,
    "text" : " It is very similar like for the experts entry the IRCC has flexibility",
    "startMs" : 1808840
  },
  {
    "startMs" : 1817440,
    "endMs" : 1823800,
    "text" : " Whether they want to do an FSW draw or just the PNP draw or the CC draw they they get to choose the program"
  },
  {
    "startMs" : 1823800,
    "text" : " They want to do just the francophone draw nothing stops them from doing that",
    "endMs" : 1827960
  },
  {
    "startMs" : 1827960,
    "endMs" : 1833640,
    "text" : " So they they developed the system that allows the maximum flexibility and that's what we have with"
  },
  {
    "endMs" : 1836160,
    "text" : " Alberta advantage immigration program",
    "startMs" : 1833640
  },
  {
    "text" : " The number of points you get does not guarantee that they will issue the invitation because what if they are looking to fill in",
    "startMs" : 1836160,
    "endMs" : 1843440
  },
  {
    "text" : " specific occupations or",
    "endMs" : 1845680,
    "startMs" : 1843440
  },
  {
    "endMs" : 1850060,
    "startMs" : 1845720,
    "text" : " Industries with candidates they may do it like nothing"
  },
  {
    "text" : " Nothing puts them under the obligation to issue",
    "endMs" : 1853060,
    "startMs" : 1850060
  },
  {
    "startMs" : 1853060,
    "endMs" : 1859180,
    "text" : " Invitations to every candidate who has 80 points or 90 points. They can do"
  },
  {
    "text" : " Different programs like the hospitality stream, right?",
    "startMs" : 1859180,
    "endMs" : 1863520
  },
  {
    "endMs" : 1867840,
    "startMs" : 1863520,
    "text" : " Hospitality and tourism stream and we've talked about it. They can"
  },
  {
    "endMs" : 1871160,
    "text" : " limit and target specific candidates from",
    "startMs" : 1867840
  },
  {
    "startMs" : 1871680,
    "endMs" : 1878120,
    "text" : " Every program program and that's what they talked about that. It's one thing that you can submit an expression of interest"
  },
  {
    "startMs" : 1878120,
    "endMs" : 1880400,
    "text" : " through the AIIP"
  },
  {
    "startMs" : 1880400,
    "text" : " But you also have to meet the minimum eligibility requirements for the existing programs such as the AUS or tourism hospitality stream, etc",
    "endMs" : 1888560
  },
  {
    "startMs" : 1888560,
    "endMs" : 1894520,
    "text" : " So it's it's very similar to how we have things going on with experts entry right now"
  },
  {
    "text" : " Absolutely, and like Tony and other people like Kieran, they're all asking the same question, which is an old question",
    "endMs" : 1902840,
    "startMs" : 1895360
  },
  {
    "startMs" : 1902840,
    "endMs" : 1904840,
    "text" : " It's an old question"
  },
  {
    "endMs" : 1908620,
    "text" : " Designed for an old process at least not for Alberta",
    "startMs" : 1904840
  },
  {
    "endMs" : 1912120,
    "text" : " So understand you guys that it's not all about this",
    "startMs" : 1908620
  },
  {
    "startMs" : 1912120,
    "endMs" : 1917160,
    "text" : " So technically Igor you could have someone and I want to reiterate that you could have someone"
  },
  {
    "text" : " Who was drawn under the Alberta opportunity stream or I should say was eligible under the Alberta opportunity stream AOS",
    "startMs" : 1917160,
    "endMs" : 1924520
  },
  {
    "startMs" : 1924760,
    "text" : " Who submitted this expression of interest who has?",
    "endMs" : 1928520
  },
  {
    "startMs" : 1928520,
    "endMs" : 1931400,
    "text" : " 100 points"
  },
  {
    "text" : " who does not receive a",
    "startMs" : 1931400,
    "endMs" : 1933480
  },
  {
    "startMs" : 1933480,
    "text" : " Notification of interest from the province it is entirely possible and if you look at the actual instructions",
    "endMs" : 1942300
  },
  {
    "text" : " you can see they reiterate over and over again that workers will be scored and ranked using the grid and",
    "startMs" : 1942300,
    "endMs" : 1950760
  },
  {
    "endMs" : 1959440,
    "text" : " Candidates who are six who successfully submit the expression of interest will be placed into the worker stream pool to be considered for selection",
    "startMs" : 1951560
  },
  {
    "endMs" : 1966400,
    "startMs" : 1959440,
    "text" : " So the points themselves are not everything so they'll conduct ongoing draws from the pool"
  },
  {
    "startMs" : 1966400,
    "endMs" : 1970680,
    "text" : " for specific worker streams and pathways and they can"
  },
  {
    "endMs" : 1977700,
    "text" : " They can absolutely indicate. Well this particular industry within AOS is what we're focusing on this draw",
    "startMs" : 1970680
  },
  {
    "startMs" : 1977700,
    "text" : " so if you are a",
    "endMs" : 1979920
  },
  {
    "text" : " Healthcare worker, although there's a healthcare stream. I'm just using that as an example and you are through AOS",
    "endMs" : 1986160,
    "startMs" : 1980400
  },
  {
    "text" : " Well, we're only drawing people in this particular industry",
    "startMs" : 1986160,
    "endMs" : 1989120
  },
  {
    "text" : " So they have the ability to create",
    "startMs" : 1989120,
    "endMs" : 1991400
  },
  {
    "text" : " subcategories within AOS to target the people that they most feel are needed for the province and you can see the",
    "startMs" : 1991400,
    "endMs" : 1999080
  },
  {
    "endMs" : 2005440,
    "startMs" : 1999080,
    "text" : " AIP will select and invite candidates from the worker stream pool based on the candidates EOI"
  },
  {
    "startMs" : 2006160,
    "endMs" : 2010160,
    "text" : " Score rankings you see and everybody's stuck on that. They're like, this is it?"
  },
  {
    "endMs" : 2014640,
    "text" : " this is it the rankings, but they but this is something that people don't understand and",
    "startMs" : 2010160
  },
  {
    "text" : " Provincial labor market needs and priorities. This blows everything open just",
    "endMs" : 2021320,
    "startMs" : 2014640
  },
  {
    "startMs" : 2021320,
    "endMs" : 2029040,
    "text" : " Because they can literally target any person that they want they do not restrict themselves"
  },
  {
    "text" : " But what they do by an expression of interest is allow themselves to have a measure",
    "endMs" : 2034440,
    "startMs" : 2029040
  },
  {
    "startMs" : 2034800,
    "endMs" : 2040760,
    "text" : " To at the first instance compare one candidate to another and then from there"
  },
  {
    "startMs" : 2040760,
    "text" : " They look at their occupation all these other little details the industry they're working in",
    "endMs" : 2046920
  },
  {
    "endMs" : 2054240,
    "startMs" : 2046920,
    "text" : " What is the province really need right now? So understand that, you know a number of factors. Let's keep looking at this quickly"
  },
  {
    "startMs" : 2054240,
    "endMs" : 2057080,
    "text" : " available AIP nominations well"
  },
  {
    "text" : " If they don't have any more space, that's a factor then they'll move to another stream",
    "endMs" : 2062920,
    "startMs" : 2057080
  },
  {
    "text" : " And like I said, I wouldn't be surprised of hotel and hospitality. They've got room there, right?",
    "endMs" : 2067560,
    "startMs" : 2062920
  },
  {
    "startMs" : 2067560,
    "endMs" : 2074920,
    "text" : " And you can see application levels. So where they're at in terms of the you know, the processing and what they have in the queue"
  },
  {
    "startMs" : 2074920,
    "endMs" : 2077120,
    "text" : " and then of course individuals"
  },
  {
    "text" : " They'll receive the ITA an invitation by email in the same way that people do through the express entry streams",
    "startMs" : 2077120,
    "endMs" : 2084040
  },
  {
    "startMs" : 2084040,
    "endMs" : 2086320,
    "text" : " So if you're wondering well, how is this gonna play out? Oh"
  },
  {
    "endMs" : 2094560,
    "startMs" : 2087480,
    "text" : " exactly similar to the express entry stream process where if they give you a notification of interest and"
  },
  {
    "endMs" : 2100120,
    "text" : " The only difference is in this case. You're submitting your expression of interest where with the express entry streams",
    "startMs" : 2094560
  },
  {
    "endMs" : 2103240,
    "startMs" : 2100120,
    "text" : " They're passive you submit your profile to the express entry pool"
  },
  {
    "startMs" : 2103240,
    "text" : " And then the Alberta Advantage immigration program if they like you they send you a notification of interest",
    "endMs" : 2108800
  },
  {
    "endMs" : 2111520,
    "text" : " directly to your your",
    "startMs" : 2108800
  },
  {
    "endMs" : 2118360,
    "startMs" : 2112520,
    "text" : " you get a notification through IRCC's portal and then you have a certain time period to respond and"
  },
  {
    "startMs" : 2118360,
    "endMs" : 2125240,
    "text" : " It'll be very very similar a very similar process and you can mark. No. Yeah, I will have chicken"
  },
  {
    "endMs" : 2129560,
    "startMs" : 2125240,
    "text" : " My is what he's gonna do. They're gonna mug him"
  },
  {
    "endMs" : 2133360,
    "text" : " Yeah, so it's getting a little late",
    "startMs" : 2129560
  },
  {
    "text" : " My battery is about to die, but it was a pleasure to connect with everyone and discuss this important topic",
    "startMs" : 2133360,
    "endMs" : 2139040
  },
  {
    "text" : " Like I invite everyone just to go to our website and check out the blog post. It's really important",
    "startMs" : 2140160,
    "endMs" : 2145880
  },
  {
    "text" : " if we will do another video talk in the detail about the",
    "startMs" : 2145880,
    "endMs" : 2149800
  },
  {
    "endMs" : 2156520,
    "text" : " Expression of interest system. So mark, I will I will leave and I will leave sounds good or leading the life",
    "startMs" : 2149800
  },
  {
    "startMs" : 2156520,
    "text" : " So, thank you everyone and I'll see you later",
    "endMs" : 2159120
  },
  {
    "endMs" : 2164480,
    "text" : " You bet bye. Bye. No problem. Take care. All right. We'll let Igor slip away",
    "startMs" : 2159120
  },
  {
    "startMs" : 2164480,
    "text" : " So basically what I'm just trying to understand is that it's not as rigid as you think",
    "endMs" : 2169240
  },
  {
    "text" : " So when you submit an expression of interest, they look at a number of different factors now built into the points grid",
    "endMs" : 2175200,
    "startMs" : 2169480
  },
  {
    "endMs" : 2179960,
    "text" : " Which is probably as good a time as any to slide over here and and to actually look at it",
    "startMs" : 2175200
  },
  {
    "startMs" : 2179960,
    "endMs" : 2183040,
    "text" : " I'll just take Igor and we'll just drop him right off of here"
  },
  {
    "startMs" : 2183040,
    "endMs" : 2186840,
    "text" : " When you're when you're actually looking at the point grid here"
  },
  {
    "startMs" : 2186840,
    "text" : " I'll expand myself here there when you're looking at the point grid. You will see that. Yes, there are a number of",
    "endMs" : 2193120
  },
  {
    "text" : " Factors that they look at and they assign points to them",
    "startMs" : 2193920,
    "endMs" : 2197440
  },
  {
    "endMs" : 2202880,
    "startMs" : 2197440,
    "text" : " But if you look at the qualifications for the programs that still their underlying rationale"
  },
  {
    "startMs" : 2202880,
    "endMs" : 2208360,
    "text" : " They still feel that once a person meets the eligibility threshold for most of the programs"
  },
  {
    "text" : " Which is often one year of Canadian work experience",
    "startMs" : 2208360,
    "endMs" : 2211160
  },
  {
    "endMs" : 2218160,
    "startMs" : 2211160,
    "text" : " Then they don't really care to them and for their purposes someone who has three years of Canadian of work experience"
  },
  {
    "startMs" : 2218160,
    "text" : " Let's say right in Alberta is no",
    "endMs" : 2220160
  },
  {
    "text" : " Necessarily better candidate for them than someone who has 12 months and that's why when you're looking at this",
    "startMs" : 2220720,
    "endMs" : 2225720
  },
  {
    "startMs" : 2225720,
    "text" : " If we just jump down to work experience, that's why it says 12 or more months",
    "endMs" : 2229480
  },
  {
    "startMs" : 2229480,
    "endMs" : 2236160,
    "text" : " Everybody will get the same 11 points. So and then 6 to 11 months. What is 6 to 11?"
  },
  {
    "startMs" : 2236160,
    "endMs" : 2242320,
    "text" : " Well, there are some programs that are 6 months if you're a post-grad work permit holder and others"
  },
  {
    "startMs" : 2242320,
    "endMs" : 2247640,
    "text" : " Then they would fall into that realm if they wanted to apply a little bit earlier and it's interesting"
  },
  {
    "endMs" : 2250200,
    "text" : " one thing we don't know is if",
    "startMs" : 2247920
  },
  {
    "endMs" : 2256880,
    "startMs" : 2250200,
    "text" : " Someone is at the 11 month period and they fill in the information in their expression of interest and then they keep working"
  },
  {
    "endMs" : 2264000,
    "text" : " Does it automatically roll over to 11 like Express Entry does? Well, I have to assume that it probably does",
    "startMs" : 2256880
  },
  {
    "text" : " I'm I'm pretty confident the province of Alberta when they develop this it's sophisticated enough to do this",
    "endMs" : 2269680,
    "startMs" : 2264000
  },
  {
    "endMs" : 2273560,
    "text" : " But we'll just have to see but let's just start from the top and let's whip through this",
    "startMs" : 2269680
  },
  {
    "startMs" : 2273560,
    "text" : " but as we go through here, I just want to just pull up a few a",
    "endMs" : 2278640
  },
  {
    "startMs" : 2278640,
    "text" : " Few comments people are the the viewers and listeners have have been really patient",
    "endMs" : 2284080
  },
  {
    "startMs" : 2284080,
    "text" : " But I want to give just a couple shoutouts to some of the questions",
    "endMs" : 2287280
  },
  {
    "text" : " Three crafty kids says I filed under the rural program as an outlander now, they're mostly rejecting outlanders",
    "startMs" : 2287280,
    "endMs" : 2294000
  },
  {
    "text" : " Well, and that's true like because there's so many people in Canada",
    "startMs" : 2294000,
    "endMs" : 2297280
  },
  {
    "text" : " They they can pull from individuals that are already living and working in Canada that people outside of Canada",
    "startMs" : 2297280,
    "endMs" : 2303360
  },
  {
    "startMs" : 2303360,
    "endMs" : 2305360,
    "text" : " They just they just don't have"
  },
  {
    "endMs" : 2312060,
    "text" : " Like they want to take care of people in Canada first and it's messy guys. It's messy",
    "startMs" : 2305360
  },
  {
    "startMs" : 2312060,
    "endMs" : 2315560,
    "text" : " Okay, let's see what else we have here"
  },
  {
    "startMs" : 2315560,
    "endMs" : 2321320,
    "text" : " Joe says hey marketing or what do you expect on the first draw from this new system? I think I told you guys"
  },
  {
    "endMs" : 2326760,
    "text" : " I think it's probably where there's room which is tourism right in hospitality. That's my that's my bet",
    "startMs" : 2321320
  },
  {
    "startMs" : 2326760,
    "endMs" : 2329640,
    "text" : " Jordan, so that's that's my bet Joe"
  },
  {
    "startMs" : 2329640,
    "endMs" : 2331640,
    "text" : " Um"
  },
  {
    "text" : " Okay, so",
    "endMs" : 2334200,
    "startMs" : 2331640
  },
  {
    "endMs" : 2335600,
    "text" : " Jordan says hi",
    "startMs" : 2334200
  },
  {
    "endMs" : 2340720,
    "startMs" : 2335600,
    "text" : " I'm working with an Alberta employer on a closed work permit from the last month and have a valid express engine problem"
  },
  {
    "text" : " So can I apply for this expression of interest? Please clarify? Okay, that's a great segue",
    "endMs" : 2345080,
    "startMs" : 2340720
  },
  {
    "startMs" : 2345080,
    "endMs" : 2349300,
    "text" : " So let's go back and let's just take a look at some of the the factors that they look at"
  },
  {
    "startMs" : 2349300,
    "endMs" : 2352000,
    "text" : " So when you're submitting your expression of interest"
  },
  {
    "endMs" : 2356000,
    "startMs" : 2352000,
    "text" : " There really isn't barriers to submitting it that I'm aware of"
  },
  {
    "text" : " When you're going to submit it, you're gonna be able to answer the questions. And if we look specifically at work experience in Alberta",
    "startMs" : 2356760,
    "endMs" : 2363960
  },
  {
    "endMs" : 2372900,
    "startMs" : 2363960,
    "text" : " there's an option here less than six months which would be you if you just started if you're currently employed in Alberta and"
  },
  {
    "text" : " It says it includes all experience accumulated in Canada and abroad",
    "startMs" : 2372900,
    "endMs" : 2376920
  },
  {
    "text" : " So total work experience if you have less than six months or six to eleven months or twelve months or more",
    "startMs" : 2376920,
    "endMs" : 2383800
  },
  {
    "endMs" : 2389760,
    "text" : " And this is for remember this here is work experience that's included in Canada and abroad",
    "startMs" : 2383800
  },
  {
    "startMs" : 2389760,
    "text" : " So you can that totals it's kind of like a duplication. You can have a maximum of 11 points",
    "endMs" : 2394880
  },
  {
    "text" : " Well, if you've never worked anywhere but in Canada, then you could get three points for that work experience in Canada",
    "startMs" : 2394880,
    "endMs" : 2400840
  },
  {
    "startMs" : 2400840,
    "endMs" : 2407200,
    "text" : " It includes both experience in Alberta and other provinces or territories in Canada, not Alberta"
  },
  {
    "endMs" : 2412000,
    "startMs" : 2407200,
    "text" : " I guess they're just feeling like they have to explain that twice and award higher points between the two scores"
  },
  {
    "startMs" : 2412120,
    "endMs" : 2419400,
    "text" : " So they will look at this collectively you can get a maximum of 21 points total and you can see here"
  },
  {
    "text" : " Six months or more work experience in Alberta will give you ten points",
    "endMs" : 2423800,
    "startMs" : 2419400
  },
  {
    "text" : " So it'll give you the maximum points",
    "startMs" : 2423800,
    "endMs" : 2425920
  },
  {
    "startMs" : 2425920,
    "endMs" : 2430560,
    "text" : " Six months or more work experience in another province or territory not Alberta is not as valuable"
  },
  {
    "endMs" : 2434040,
    "text" : " Because if you worked in Alberta and you've got at least six months",
    "startMs" : 2430560
  },
  {
    "endMs" : 2439880,
    "startMs" : 2434040,
    "text" : " it's more likely you're gonna stick around than someone who just parachutes in gets the expression of interest in gets a"
  },
  {
    "text" : " Notification like an invitation to apply and then they get their nomination and then take off back to Ontario right from where they came",
    "startMs" : 2440040,
    "endMs" : 2447640
  },
  {
    "startMs" : 2447640,
    "text" : " But there's a number of factors that that kick in when they're doing these assessments, but these are just some of the points",
    "endMs" : 2453400
  },
  {
    "startMs" : 2453400,
    "endMs" : 2459000,
    "text" : " That are awarded to individuals to try to determine if they have the basic information"
  },
  {
    "text" : " Needed to be able to be considered realistically for nomination",
    "startMs" : 2459000,
    "endMs" : 2463200
  },
  {
    "startMs" : 2463200,
    "endMs" : 2468720,
    "text" : " Let's just start and let's just go through this. I've been jumping around a little bit so you can see education here"
  },
  {
    "endMs" : 2472840,
    "startMs" : 2469160,
    "text" : " They do distinguish between doctoral degree and master's degree"
  },
  {
    "startMs" : 2472840,
    "endMs" : 2478200,
    "text" : " Okay, and then it says location of highest level of education completed in Canada"
  },
  {
    "startMs" : 2478200,
    "endMs" : 2484760,
    "text" : " So if you have Canadian education and this is overall education, so it doesn't ask it doesn't really distinguish here"
  },
  {
    "startMs" : 2484760,
    "endMs" : 2488640,
    "text" : " But if it's completed in Alberta, you're gonna get bonus points, which makes sense"
  },
  {
    "text" : " once again work experience or any experience in Alberta is going to be valued more than just general Canadian experience and",
    "startMs" : 2488640,
    "endMs" : 2494840
  },
  {
    "text" : " Understand you guys that these few little differentiations these these difference in four points could make all the difference for",
    "startMs" : 2495600,
    "endMs" : 2502220
  },
  {
    "text" : " you know individuals when it comes down to",
    "startMs" : 2502220,
    "endMs" : 2505300
  },
  {
    "text" : " notifications of interest",
    "endMs" : 2507720,
    "startMs" : 2505300
  },
  {
    "text" : " It's possible, but remember Alberta is not bound just to these points. Remember that",
    "startMs" : 2507720,
    "endMs" : 2514200
  },
  {
    "startMs" : 2514200,
    "endMs" : 2517560,
    "text" : " Okay language you can see once again. We talked about this"
  },
  {
    "text" : " Well the minimum some programs allow up to a full like is as low as a four",
    "endMs" : 2522480,
    "startMs" : 2517560
  },
  {
    "startMs" : 2522560,
    "endMs" : 2529240,
    "text" : " Well all they care about okay, they're based on the lowest score for all four language competencies on the test taken"
  },
  {
    "startMs" : 2529240,
    "endMs" : 2534000,
    "text" : " So what it means is if you have a four in writing and you have a nine and everything else"
  },
  {
    "endMs" : 2536920,
    "text" : " Well, then you're gonna have to put four",
    "startMs" : 2534000
  },
  {
    "startMs" : 2536920,
    "endMs" : 2541760,
    "text" : " right here as the threshold because all they're asking for is"
  },
  {
    "endMs" : 2549580,
    "startMs" : 2541760,
    "text" : " The one lowest score of all the four things that you've taken interesting. Hey, it's kind of interesting, but that's what they're doing here"
  },
  {
    "text" : " They'll score for both English and French and award the higher points between the two scores",
    "endMs" : 2555120,
    "startMs" : 2550440
  },
  {
    "startMs" : 2555120,
    "endMs" : 2558640,
    "text" : " So if you have both of them, they'll use whichever is hired as kind of the principle"
  },
  {
    "startMs" : 2558640,
    "text" : " And then as you go through here, you'll see if you do speak both you get bonus points once again",
    "endMs" : 2565920
  },
  {
    "startMs" : 2565920,
    "endMs" : 2571640,
    "text" : " So as long as you have at least an NC LC or a CLB four or higher in both of them"
  },
  {
    "startMs" : 2571640,
    "endMs" : 2578560,
    "text" : " You're gonna get the bonus three points and those little points make a difference and CLB four is not too hard"
  },
  {
    "text" : " So, what do we tell people over and over the days of you know, the golden ages?",
    "startMs" : 2578840,
    "endMs" : 2585000
  },
  {
    "endMs" : 2591420,
    "text" : " I described before francophone immigration are still here alive and well and even for the province of Alberta",
    "startMs" : 2585000
  },
  {
    "text" : " And I think they've all received marching orders from the feds that they have to incorporate something that targets francophone",
    "startMs" : 2591420,
    "endMs" : 2596760
  },
  {
    "startMs" : 2596760,
    "text" : " applicants",
    "endMs" : 2599000
  },
  {
    "text" : " Individuals who are going even to Alberta who speak French have a leg up over people that just speak English even in Alberta",
    "endMs" : 2606420,
    "startMs" : 2599000
  },
  {
    "startMs" : 2606560,
    "text" : " all right work experience like we talked about once you hit 12 months or more and this is include it includes all",
    "endMs" : 2612320
  },
  {
    "startMs" : 2612320,
    "text" : " Experience accumulated in Canada and abroad. So this is overseas experience as well",
    "endMs" : 2616800
  },
  {
    "endMs" : 2617960,
    "text" : " Really?",
    "startMs" : 2616800
  },
  {
    "endMs" : 2622440,
    "text" : " They're not giving a lot of points for someone who has three four or five six seven ten years",
    "startMs" : 2617960
  },
  {
    "startMs" : 2622440,
    "endMs" : 2625960,
    "text" : " It comes down to do you have the minimum and that's good enough?"
  },
  {
    "text" : " However, once again, there is bonus points for work experience in Canada. So you this could be double you've got one year in Canada",
    "startMs" : 2625960,
    "endMs" : 2633700
  },
  {
    "endMs" : 2637020,
    "text" : " well, you get points for here 11 points and",
    "startMs" : 2633860
  },
  {
    "startMs" : 2637020,
    "text" : " Six or more if it's in Alberta, then you can get the other ten points if it's outside",
    "endMs" : 2642460
  },
  {
    "text" : " Then you're just gonna get the six. Okay. I think you guys get that. We don't need to spend a lot of time",
    "startMs" : 2642460,
    "endMs" : 2646500
  },
  {
    "endMs" : 2648820,
    "startMs" : 2646500,
    "text" : " Interesting here, isn't it?"
  },
  {
    "startMs" : 2648820,
    "text" : " 18 to 23 points 21 to 34 is five points",
    "endMs" : 2653660
  },
  {
    "startMs" : 2653660,
    "text" : " So this is now the sweet spot for Alberta unlike Express Entry where it caps at 29 then you start losing points",
    "endMs" : 2660980
  },
  {
    "startMs" : 2661460,
    "endMs" : 2665740,
    "text" : " Here it's 34 and then it's not really a big loss"
  },
  {
    "endMs" : 2671180,
    "text" : " So 49 you get four and hey, look at this you guys even me old man",
    "startMs" : 2665740
  },
  {
    "text" : " Mark who's turning 52 in one week. I would still get points. Oh, I love my province. Isn't that nice?",
    "startMs" : 2671180,
    "endMs" : 2678940
  },
  {
    "endMs" : 2685820,
    "startMs" : 2678940,
    "text" : " Okay family connection people were wondering for a long time. How do they even treat family connection?"
  },
  {
    "startMs" : 2686280,
    "endMs" : 2689640,
    "text" : " Why do they even ask or care? We never hear about family draws"
  },
  {
    "startMs" : 2689640,
    "endMs" : 2693860,
    "text" : " Well, it is a factor and if you have a family member who lives in Alberta"
  },
  {
    "startMs" : 2693860,
    "endMs" : 2699160,
    "text" : " That's a big deal because there's more likely that you would then stay in Alberta yourself"
  },
  {
    "startMs" : 2699160,
    "endMs" : 2701920,
    "text" : " And so there's eight whopping points"
  },
  {
    "startMs" : 2701920,
    "endMs" : 2704240,
    "text" : " Do you see this eight points that is?"
  },
  {
    "endMs" : 2709880,
    "startMs" : 2704240,
    "text" : " Attributed if you have a family member living in Alberta who is a Canadian citizen or permanent resident 18 years of age"
  },
  {
    "startMs" : 2710160,
    "text" : " Now remember it is restricted to a parent a grandparent a child a grandchild",
    "endMs" : 2716560
  },
  {
    "startMs" : 2716560,
    "endMs" : 2720080,
    "text" : " Sibling but it goes out there"
  },
  {
    "endMs" : 2725000,
    "startMs" : 2720080,
    "text" : " It goes out an uncle an aunt a niece or even a nephew now"
  },
  {
    "endMs" : 2730260,
    "text" : " It doesn't have cousin on there you guys so all of my good friends from India",
    "startMs" : 2725000
  },
  {
    "endMs" : 2733360,
    "startMs" : 2730260,
    "text" : " Who's every member of their community is their cousin?"
  },
  {
    "startMs" : 2733360,
    "text" : " that doesn't count here so cousins are too far, but",
    "endMs" : 2737120
  },
  {
    "text" : " Your cousin's parents who are siblings to your parents",
    "startMs" : 2738040,
    "endMs" : 2741920
  },
  {
    "startMs" : 2741920,
    "endMs" : 2749760,
    "text" : " Your parents do count so niece nephew uncle aunt sibling and the rest eight points. It's a big deal"
  },
  {
    "startMs" : 2749760,
    "endMs" : 2755340,
    "text" : " Okay. Now guys this these economic factors are important"
  },
  {
    "text" : " the whole underlying principle behind the Alberta advantage immigration program and all the PNPs is",
    "endMs" : 2762840,
    "startMs" : 2755340
  },
  {
    "endMs" : 2769660,
    "text" : " That each candidate must demonstrate the ability to economically establish themselves in that province",
    "startMs" : 2763440
  },
  {
    "endMs" : 2774940,
    "text" : " So how do they determine that well Alberta is all about work permits and yes you guys",
    "startMs" : 2769660
  },
  {
    "endMs" : 2778220,
    "text" : " Yes, maintain status is still a thing",
    "startMs" : 2774940
  },
  {
    "text" : " It's not disappearing now Alberta has agreed to participate with the feds and that narrow little program for people who were you know",
    "endMs" : 2785560,
    "startMs" : 2778220
  },
  {
    "endMs" : 2791180,
    "startMs" : 2785560,
    "text" : " Who fall under that exemption where you know, they'll agree to issue them a work permit"
  },
  {
    "startMs" : 2791280,
    "endMs" : 2797280,
    "text" : " But aside from that narrow exemption, they're still expect you to maintain a valid work permit"
  },
  {
    "text" : " So keep that in mind that hasn't changed",
    "endMs" : 2799280,
    "startMs" : 2797280
  },
  {
    "endMs" : 2801760,
    "text" : " And as you look here",
    "startMs" : 2799280
  },
  {
    "startMs" : 2801760,
    "text" : " so a job offer for permanent full-time employment in Alberta could be a maximum of ten points and those points can come from",
    "endMs" : 2809120
  },
  {
    "startMs" : 2809120,
    "endMs" : 2816440,
    "text" : " Six points here or up to five or more right here with the job offer and you can see there's other"
  },
  {
    "text" : " Regulated occupation that's different. So we stay focused on this this just this chart here. So ten points you can see",
    "startMs" : 2818200,
    "endMs" : 2825480
  },
  {
    "startMs" : 2825480,
    "endMs" : 2829560,
    "text" : " for a permanent full-time job offer in Alberta and then"
  },
  {
    "endMs" : 2836800,
    "text" : " Six points if the job offer is to work and I should say let me rephrase this. So there's a maximum of 31 points",
    "startMs" : 2829560
  },
  {
    "startMs" : 2836800,
    "text" : " Maximum total points of 16 for the job offers which are this right here and then another five for the location",
    "endMs" : 2843760
  },
  {
    "startMs" : 2843760,
    "endMs" : 2847120,
    "text" : " So just to break this down Alberta is big on rural"
  },
  {
    "text" : " So if you live outside of Edmonton and Calgary and you can see it's right down here",
    "startMs" : 2847120,
    "endMs" : 2853160
  },
  {
    "startMs" : 2853160,
    "endMs" : 2860100,
    "text" : " Calgary census metropolitan area Edmonton, then you are not getting any points for your location"
  },
  {
    "endMs" : 2862040,
    "text" : " but if you're outside of those areas",
    "startMs" : 2860100
  },
  {
    "startMs" : 2862040,
    "text" : " Then you can get up to five points and a road renewal stream designated community or an other Alberta community",
    "endMs" : 2868960
  },
  {
    "endMs" : 2873280,
    "startMs" : 2868960,
    "text" : " That's outside of Edmonton and Calgary essentially can get the five points for everywhere else"
  },
  {
    "startMs" : 2873280,
    "endMs" : 2879920,
    "text" : " You can get a bonus five points and then if an individual has a job offer this ten points right here"
  },
  {
    "startMs" : 2879920,
    "endMs" : 2883380,
    "text" : " There's not a lot of explanation, but this you guys is not"
  },
  {
    "text" : " lmi a based so if you have just a regular open work permit and",
    "endMs" : 2888480,
    "startMs" : 2883380
  },
  {
    "text" : " There's an employer that supports you. It does not look on the surface",
    "startMs" : 2888480,
    "endMs" : 2893640
  },
  {
    "endMs" : 2901220,
    "startMs" : 2894240,
    "text" : " Let's say you're let's run us. Let's say you're on a spousal open work permit or you're on a postgrad work permit from a different province"
  },
  {
    "text" : " Right now we don't see any restrictions on",
    "startMs" : 2901220,
    "endMs" : 2905520
  },
  {
    "endMs" : 2912920,
    "text" : " Claiming those ten points for a job offer from the company. And once again, that's not an lmi a based job offer",
    "startMs" : 2905520
  },
  {
    "startMs" : 2912920,
    "text" : " This is a big deal before there were some limited exceptions to job offers. But ultimately the the",
    "endMs" : 2919080
  },
  {
    "startMs" : 2920000,
    "text" : " For open work permit holders with job offers that were limited exceptions, but generally it was employer specific work permits",
    "endMs" : 2925540
  },
  {
    "startMs" : 2925540,
    "endMs" : 2929260,
    "text" : " So we'll see how this plays out. We don't have a hundred percent confirmation"
  },
  {
    "endMs" : 2936320,
    "startMs" : 2929260,
    "text" : " But it sure looks like you could get those maximum, you know ten points if your employers willing to do their part and support you"
  },
  {
    "startMs" : 2936320,
    "endMs" : 2938080,
    "text" : " Okay"
  },
  {
    "startMs" : 2938080,
    "text" : " We went through this. We're just about done guys last job offer in a regulated occupation. Some people are confused about this",
    "endMs" : 2945200
  },
  {
    "endMs" : 2950080,
    "startMs" : 2945760,
    "text" : " many professional occupations that designated occupations and trades are"
  },
  {
    "endMs" : 2951920,
    "text" : " regulated in Alberta",
    "startMs" : 2950080
  },
  {
    "startMs" : 2951920,
    "endMs" : 2958000,
    "text" : " And if you have trade certification or a professional designation like you're a nurse or you are a welder"
  },
  {
    "text" : " Then you can get an extra ten points. All right, so",
    "startMs" : 2958000,
    "endMs" : 2961880
  },
  {
    "text" : " Yeah, and and it's basically it says only those who have an Alberta job offer in a regulated occupation and",
    "startMs" : 2961880,
    "endMs" : 2968800
  },
  {
    "startMs" : 2969320,
    "endMs" : 2977020,
    "text" : " Who meet the requirements set out by the professional body or the apprenticeship and industry training? That's what a IT stands for for Alberta"
  },
  {
    "startMs" : 2977020,
    "endMs" : 2981440,
    "text" : " Okay, so we don't need to really pay too much attention about the other stuff here"
  },
  {
    "startMs" : 2981440,
    "endMs" : 2986100,
    "text" : " There will definitely be as you're filling out your profile"
  },
  {
    "endMs" : 2992920,
    "text" : " And submitting your expression of interest you will need to understand the primary line of business and understand the NAICS code",
    "startMs" : 2986100
  },
  {
    "endMs" : 2996400,
    "text" : " Which is different than NOC and select your own NOC",
    "startMs" : 2992920
  },
  {
    "startMs" : 2996400,
    "endMs" : 3002440,
    "text" : " But at this stage, this is kind of a breakdown of the points. So we flip back here"
  },
  {
    "endMs" : 3008280,
    "startMs" : 3002440,
    "text" : " I'll just remove Igor from here. So we've talked about just to recap everybody"
  },
  {
    "startMs" : 3008280,
    "text" : " We talked about a little bit of an overview of the changes. We've talked about the new expression of interest system",
    "endMs" : 3013800
  },
  {
    "startMs" : 3013800,
    "text" : " Remember, there's no fee and there's no rush to submit it on September 30th. Take your time",
    "endMs" : 3019240
  },
  {
    "text" : " Make sure you get it, right",
    "startMs" : 3019240,
    "endMs" : 3020600
  },
  {
    "endMs" : 3026180,
    "startMs" : 3020600,
    "text" : " One thing I will point out that some people won't yet be aware of is that unlike Express Entry?"
  },
  {
    "startMs" : 3026180,
    "text" : " You will not have the ability to edit or modify your your expression of interest",
    "endMs" : 3032000
  },
  {
    "endMs" : 3036800,
    "text" : " you actually have to decline it or remove it delete it, whatever they call it in the portal and",
    "startMs" : 3032000
  },
  {
    "startMs" : 3036800,
    "text" : " Then resubmit a new one if you are making changes",
    "endMs" : 3040620
  },
  {
    "endMs" : 3048520,
    "startMs" : 3040620,
    "text" : " All right, and that maybe is a hint that maybe it won't automatically update hard to know for certain. I guess we'll find out"
  },
  {
    "endMs" : 3053200,
    "text" : " Okay, let's see. What else we've got. Let's get to some more questions",
    "startMs" : 3049560
  },
  {
    "endMs" : 3056020,
    "startMs" : 3053200,
    "text" : " you can see Shalias here says"
  },
  {
    "startMs" : 3056020,
    "endMs" : 3057960,
    "text" : " Hi, Mark and Igor any idea?"
  },
  {
    "startMs" : 3057960,
    "text" : " What will be the passing points to be able to get an ITA on September 30th?",
    "endMs" : 3061800
  },
  {
    "startMs" : 3061800,
    "text" : " Do you think there will be queue again upon signing in your account? Thanks. No queues",
    "endMs" : 3065760
  },
  {
    "startMs" : 3065760,
    "endMs" : 3070880,
    "text" : " No race to file make sure you've got your Alberta account and for those who are wondering"
  },
  {
    "endMs" : 3077780,
    "startMs" : 3070880,
    "text" : " What is the Alberta account if we flip back here? Just go to the main. This is the the Alberta advantage updates page"
  },
  {
    "endMs" : 3082360,
    "text" : " This is where we have a little bit of a general overview of the details of the new",
    "startMs" : 3077800
  },
  {
    "text" : " worker streams",
    "endMs" : 3084320,
    "startMs" : 3082360
  },
  {
    "endMs" : 3091200,
    "text" : " Expression of interest you can go down here right here. And this is where you will click on your Alberta account",
    "startMs" : 3084320
  },
  {
    "endMs" : 3092340,
    "startMs" : 3091200,
    "text" : " You'll go here"
  },
  {
    "text" : " if you have not already done so and you will register for one of these it should only take about",
    "endMs" : 3096800,
    "startMs" : 3092340
  },
  {
    "endMs" : 3099120,
    "startMs" : 3096800,
    "text" : " 10 minutes to do this and"
  },
  {
    "endMs" : 3105200,
    "startMs" : 3099120,
    "text" : " Realistically, it's probably only going to take most people if you have all your documentation ready about 20 minutes"
  },
  {
    "startMs" : 3105200,
    "text" : " Maybe 25 minutes to submit and complete and submit your expression of interest",
    "endMs" : 3110480
  },
  {
    "text" : " Okay, so remember this right here is where you're gonna get your access. You have to have that account",
    "endMs" : 3118560,
    "startMs" : 3110480
  },
  {
    "startMs" : 3118560,
    "endMs" : 3121360,
    "text" : " It's kind of like a GC key and then from there"
  },
  {
    "startMs" : 3121360,
    "text" : " You'll be able to submit your expression of interest and remember you could be inside Canada submit an expression of interest outside Canada",
    "endMs" : 3128560
  },
  {
    "text" : " You could be in another province. You could be in Alberta",
    "endMs" : 3131220,
    "startMs" : 3128560
  },
  {
    "text" : " It's gonna be pretty open to submit it and then at the end of the day",
    "startMs" : 3131220,
    "endMs" : 3134680
  },
  {
    "startMs" : 3134680,
    "endMs" : 3141480,
    "text" : " You'll see, you know, really that it's still pretty hyper competitive for people who are already in Alberta. All right"
  },
  {
    "endMs" : 3148320,
    "text" : " Okay, let's go to a couple more questions here and then we'll jump in and I'll jump to a quick super chat",
    "startMs" : 3141480
  },
  {
    "text" : " Okay, this is kind of out",
    "endMs" : 3151320,
    "startMs" : 3148320
  },
  {
    "text" : " Tamki this is out of the kind of the area",
    "endMs" : 3154360,
    "startMs" : 3151320
  },
  {
    "startMs" : 3154360,
    "endMs" : 3157560,
    "text" : " I think this is more of an express entry if my employer doesn't"
  },
  {
    "text" : " Doesn't provide want to provide the reference letter for CEC and if I don't have any colleagues that would provide a letter",
    "endMs" : 3162480,
    "startMs" : 3157560
  },
  {
    "endMs" : 3164920,
    "text" : " What are the options the onus is on you to prove it?",
    "startMs" : 3162480
  },
  {
    "text" : " It's simple as that time guy you have an obligation to to prove it",
    "startMs" : 3164920,
    "endMs" : 3168520
  },
  {
    "endMs" : 3174000,
    "text" : " And so in my course, which I think many of you are probably aware that I have my express entry course",
    "startMs" : 3168520
  },
  {
    "startMs" : 3174000,
    "endMs" : 3178780,
    "text" : " I strongly strongly encourage you to subscribe to it in that course. I have a"
  },
  {
    "text" : " document that I use specifically",
    "endMs" : 3181640,
    "startMs" : 3178780
  },
  {
    "text" : " to help",
    "startMs" : 3181640,
    "endMs" : 3183480
  },
  {
    "startMs" : 3183480,
    "endMs" : 3187960,
    "text" : " My basically the the people that are who've subscribed to it"
  },
  {
    "endMs" : 3192680,
    "text" : " Now, let me just jump back and I'll just show you I'll just show you a quick here. So we jump over here",
    "startMs" : 3187960
  },
  {
    "startMs" : 3192680,
    "endMs" : 3199360,
    "text" : " So if you go to there's a link in the description, I think for this video, it'll take you here to"
  },
  {
    "endMs" : 3205580,
    "text" : " The the landing page for the express entry accelerator and in here I have an entire section",
    "startMs" : 3199360
  },
  {
    "startMs" : 3205580,
    "text" : " I'll just I'll just bring it up really quick",
    "endMs" : 3207760
  },
  {
    "text" : " This is kind of the sponsor of this anyways",
    "startMs" : 3207760,
    "endMs" : 3210220
  },
  {
    "startMs" : 3210220,
    "endMs" : 3212080,
    "text" : " But I have a document"
  },
  {
    "startMs" : 3212120,
    "endMs" : 3219200,
    "text" : " Mastering your document section and in here it breaks down all of the sections and this record of employment lesson 48 is"
  },
  {
    "startMs" : 3219200,
    "endMs" : 3221160,
    "text" : " chock-full"
  },
  {
    "text" : " Because I shouldn't have clicked on it. It is chock-full lesson 48 of",
    "startMs" : 3221160,
    "endMs" : 3225220
  },
  {
    "startMs" : 3225220,
    "endMs" : 3229680,
    "text" : " Instructions on what to do if you can't get the reference letter, so I encourage you to slide over there"
  },
  {
    "text" : " But ultimately the wrong one here, but ultimately time guy",
    "startMs" : 3229680,
    "endMs" : 3233440
  },
  {
    "text" : " You're gonna it's gonna be tough if your employer won't give it to you. Do you have pay slips pay stubs?",
    "startMs" : 3233440,
    "endMs" : 3238060
  },
  {
    "startMs" : 3238060,
    "text" : " Do you have bank deposits? Do you have an offer letter originally?",
    "endMs" : 3241520
  },
  {
    "endMs" : 3246400,
    "startMs" : 3241520,
    "text" : " Do you have a termination letter or a relieving letter? Do you have a"
  },
  {
    "startMs" : 3246400,
    "endMs" : 3250880,
    "text" : " Supervisors that are currently working for the company that would give you an affidavit"
  },
  {
    "startMs" : 3250880,
    "endMs" : 3256700,
    "text" : " Do you have co-workers that are also willing to state what you did for the company, you know?"
  },
  {
    "endMs" : 3263160,
    "text" : " Those are things that you can look at but it's not easy when you do not have an employers willing to do that",
    "startMs" : 3256700
  },
  {
    "startMs" : 3263160,
    "endMs" : 3267320,
    "text" : " Okay. All right focusing guys on the future. We're focusing exclusively on"
  },
  {
    "text" : " On the Alberta advantage immigration program the expression of interest. Okay. Let's see. What else we have here. Any other questions?",
    "startMs" : 3268120,
    "endMs" : 3275200
  },
  {
    "startMs" : 3275200,
    "endMs" : 3277960,
    "text" : " There were a whole bunch. I"
  },
  {
    "text" : " Think we already answered Jordan's question about working with an Alberta employer on a closed work permit from last month",
    "startMs" : 3277960,
    "endMs" : 3284600
  },
  {
    "endMs" : 3288840,
    "text" : " I have a valid express entry problem. So can I apply you talked about this before earlier?",
    "startMs" : 3284600
  },
  {
    "text" : " And yeah, like there's nothing stopping you from submitting that expression of interest",
    "startMs" : 3288840,
    "endMs" : 3293080
  },
  {
    "startMs" : 3293080,
    "endMs" : 3295720,
    "text" : " We talked about the passing mark"
  },
  {
    "text" : " And and we've talked Nash. I'll bring this up for you",
    "endMs" : 3299560,
    "startMs" : 3296760
  },
  {
    "endMs" : 3303600,
    "startMs" : 3299560,
    "text" : " Nash says the expression of interest point grid makes no distinction between high of skill"
  },
  {
    "startMs" : 3303600,
    "text" : " Versus low skill work tier 1 and tier 5 can both count for 12 months experience",
    "endMs" : 3308080
  },
  {
    "endMs" : 3313200,
    "text" : " For example, that is true. So there isn't a lot of distinction but on the back end",
    "startMs" : 3308080
  },
  {
    "endMs" : 3316860,
    "startMs" : 3313200,
    "text" : " Alberta the province will look at the industry"
  },
  {
    "endMs" : 3322360,
    "text" : " They will look at the labor market and they will determine based on that where the needs are",
    "startMs" : 3316860
  },
  {
    "startMs" : 3322960,
    "endMs" : 3330360,
    "text" : " For these nominations which industries need more nominations which need less. So although on the surface, there's no restrictions"
  },
  {
    "text" : " they intend to make that that opening kind of funnel as",
    "startMs" : 3330360,
    "endMs" : 3334440
  },
  {
    "startMs" : 3334440,
    "endMs" : 3341120,
    "text" : " wide as possible to capture as many people because they don't want someone who would be a good fit to not be able to"
  },
  {
    "text" : " To be considered so they're gonna have a large large database of people that have expressed an interest and obviously",
    "startMs" : 3341120,
    "endMs" : 3348560
  },
  {
    "text" : " You know, that's how you start this whole process process. But in the end",
    "endMs" : 3353040,
    "startMs" : 3348880
  },
  {
    "startMs" : 3353040,
    "text" : " Yeah in the end, they will make that call. All right",
    "endMs" : 3357480
  },
  {
    "text" : " Okay, let's see. What else we've got everybody here. I'm just going through the past comments",
    "startMs" : 3357480,
    "endMs" : 3362320
  },
  {
    "startMs" : 3362320,
    "text" : " All I appreciate everybody letting me know where they're tuning in from. I love to see how broadly this is broadcast",
    "endMs" : 3369040
  },
  {
    "endMs" : 3376000,
    "startMs" : 3369040,
    "text" : " Okay, so Ahmed says let us know how to calculate the work experience, please and also the cutoff points"
  },
  {
    "startMs" : 3376000,
    "endMs" : 3380560,
    "text" : " Okay, so the work experience is just simple. It's it's gonna be the same as it was before"
  },
  {
    "startMs" : 3380560,
    "endMs" : 3385800,
    "text" : " Minimum of 30 hours per week, you know full-time paid all that kind of stuff"
  },
  {
    "endMs" : 3391140,
    "text" : " It's it's not gonna be any different than it was before for the Albert opportunity stream or the other programs",
    "startMs" : 3385800
  },
  {
    "startMs" : 3391140,
    "endMs" : 3396400,
    "text" : " Okay, as far as cutoff points, well, we will ultimately see how it plays out"
  },
  {
    "endMs" : 3402860,
    "text" : " But remember the cutoff points are not the be-all and end-all like they will look at a number of different factors",
    "startMs" : 3396400
  },
  {
    "startMs" : 3403860,
    "endMs" : 3405860,
    "text" : " Okay"
  },
  {
    "text" : " Let's see here. We've got Lourdes says hi from Peru in the actual context",
    "startMs" : 3405860,
    "endMs" : 3410220
  },
  {
    "endMs" : 3415700,
    "startMs" : 3410220,
    "text" : " What stream pathway do you assess for a 50 year old people worth a high level of English? Now, am I exempt for trade?"
  },
  {
    "startMs" : 3415700,
    "text" : " Agreement to start our path to migrate. I'm gonna click on right here. Oh, I don't have my sound turned up",
    "endMs" : 3422860
  },
  {
    "startMs" : 3422860,
    "text" : " Bear with me here. I have to click on this",
    "endMs" : 3425260
  },
  {
    "endMs" : 3431780,
    "text" : " Which means slide over to our firm website and anyone who has any questions or needs assistance?",
    "startMs" : 3425260
  },
  {
    "endMs" : 3435100,
    "text" : " You can go straight to our firm website once you're here",
    "startMs" : 3431780
  },
  {
    "startMs" : 3435100,
    "endMs" : 3439620,
    "text" : " It's easy book a consult speak to a lawyer which everyone works for you. And then from there"
  },
  {
    "endMs" : 3441820,
    "text" : " Excuse me",
    "startMs" : 3439620
  },
  {
    "text" : " You can have the ability to book a one-on-one meeting with one of our our lawyers in the firm Alisha myself",
    "startMs" : 3441820,
    "endMs" : 3448820
  },
  {
    "endMs" : 3457060,
    "startMs" : 3448820,
    "text" : " Igor we're all here to provide assistance to you and I'm picking the wrong one again. Okay, let's keep zipping through here"
  },
  {
    "startMs" : 3457060,
    "endMs" : 3459740,
    "text" : " Let's see. What else do we have next?"
  },
  {
    "startMs" : 3460620,
    "endMs" : 3465780,
    "text" : " Next just sorting through all the questions. Okay. Here's a good one from Nash"
  },
  {
    "text" : " How do you think they would decide on tie-breaking criteria given that multiple applications achieve similar EOI scores?",
    "startMs" : 3465780,
    "endMs" : 3471460
  },
  {
    "endMs" : 3477860,
    "text" : " The tie-breaker is always going to be the other stuff. The tie-breaker is always going to be if we flip back here",
    "startMs" : 3471460
  },
  {
    "startMs" : 3477860,
    "text" : " It's going to be the other factors that they're looking for",
    "endMs" : 3480540
  },
  {
    "text" : " okay, so when you're when like they said many times before when they're going through and doing the assessments they look at a number of",
    "startMs" : 3480540,
    "endMs" : 3488660
  },
  {
    "startMs" : 3488660,
    "endMs" : 3490460,
    "text" : " things including"
  },
  {
    "endMs" : 3495380,
    "text" : " Yes, the score ranking but labor market needs and priorities are big",
    "startMs" : 3490460
  },
  {
    "text" : " That there is the distinction that is going to be the difference maker in my mind",
    "endMs" : 3501420,
    "startMs" : 3495380
  },
  {
    "text" : " Oh, and I keep pushing the wrong one here and I know what you're saying Nash. Okay?",
    "startMs" : 3501420,
    "endMs" : 3505260
  },
  {
    "text" : " Well, what if they're all identical and then they then and then they decide, you know, you've got two people that are identical",
    "startMs" : 3505260,
    "endMs" : 3512100
  },
  {
    "startMs" : 3512100,
    "text" : " Usually people are not",
    "endMs" : 3514100
  },
  {
    "endMs" : 3521480,
    "startMs" : 3514420,
    "text" : " Siamese twins usually their backgrounds are just slightly different and I think that's ultimately how they're going to do it"
  },
  {
    "text" : " but they reserve the right even if people are identical to choose which one they want and",
    "startMs" : 3521480,
    "endMs" : 3526980
  },
  {
    "startMs" : 3526980,
    "text" : " That's entirely within their purview",
    "endMs" : 3529620
  },
  {
    "startMs" : 3529620,
    "endMs" : 3531940,
    "text" : " under their"
  },
  {
    "startMs" : 3531940,
    "endMs" : 3533940,
    "text" : " bilateral agreements with the feds"
  },
  {
    "startMs" : 3533940,
    "endMs" : 3537060,
    "text" : " Okay, let's see. What else is next. Oh, yeah"
  },
  {
    "text" : " Puneet says when is the law enforcement stream coming? Yeah, the law enforcement stream. That's a real strange one that I don't know that",
    "startMs" : 3538380,
    "endMs" : 3545540
  },
  {
    "endMs" : 3546620,
    "text" : " I don't know",
    "startMs" : 3545540
  },
  {
    "endMs" : 3550220,
    "startMs" : 3546620,
    "text" : " Okay, let's see. What else we've got lots of predictions about the expression of interest"
  },
  {
    "startMs" : 3550220,
    "text" : " Okay cam says does the program have any special work permits allowed to enter the program like IRCC special measures issued open work permits",
    "endMs" : 3560980
  },
  {
    "startMs" : 3560980,
    "text" : " Are they in the program? No",
    "endMs" : 3562860
  },
  {
    "startMs" : 3562860,
    "endMs" : 3568180,
    "text" : " Generally speaking if you have a nomination you can get an R 204 C letter which allows you to continue working"
  },
  {
    "text" : " In some instances, but no, they're not just going to issue, you know any special measures",
    "endMs" : 3574200,
    "startMs" : 3568180
  },
  {
    "startMs" : 3574200,
    "endMs" : 3581020,
    "text" : " Ultimately people that are already working on any type of a special measure permit whether it's quit or otherwise"
  },
  {
    "endMs" : 3586900,
    "startMs" : 3581020,
    "text" : " They will you know, they've had an opportunity and eligibility in the past and I do not see that changing"
  },
  {
    "text" : " Okay",
    "startMs" : 3586900,
    "endMs" : 3589940
  },
  {
    "startMs" : 3590620,
    "endMs" : 3596820,
    "text" : " Okay, let's see this individual says what a two-year contract job in Alberta be eligible or does it need to be permanent?"
  },
  {
    "text" : " well at the end of the day the employer is",
    "endMs" : 3599740,
    "startMs" : 3596820
  },
  {
    "text" : " expressing a desire to support you with the job offer and people many people already be working for their employer and",
    "startMs" : 3599740,
    "endMs" : 3607500
  },
  {
    "text" : " Many employers do have more temporal like two-year job offers, but remember",
    "startMs" : 3607500,
    "endMs" : 3612580
  },
  {
    "startMs" : 3612580,
    "endMs" : 3619700,
    "text" : " You're as a part of this PNP. You have an obligation to demonstrate that you can economically establish in Alberta"
  },
  {
    "endMs" : 3622900,
    "text" : " so the expectation would be yeah, it might be a two-year contract, but",
    "startMs" : 3619700
  },
  {
    "startMs" : 3622900,
    "endMs" : 3628020,
    "text" : " The the expectation would be that you'd be able to extend that permit and the employer would support you"
  },
  {
    "startMs" : 3628020,
    "endMs" : 3636420,
    "text" : " That's an interesting question tuna says do you have an expectation for other provinces will review their own points such as Ontario"
  },
  {
    "startMs" : 3636420,
    "text" : " I don't see that happening right now. They've been doing it for so long",
    "endMs" : 3639260
  },
  {
    "text" : " They've kind of honed it down to what they feel is working",
    "endMs" : 3642380,
    "startMs" : 3639260
  },
  {
    "endMs" : 3645680,
    "text" : " They could maybe tweak a little a few things here or there",
    "startMs" : 3642380
  },
  {
    "endMs" : 3650400,
    "text" : " But they've got a lot of flexibility within the human capital priority stream to you know",
    "startMs" : 3645680
  },
  {
    "startMs" : 3650400,
    "endMs" : 3657020,
    "text" : " To kind of target the people that they want already, so I don't anticipate too many changes tuna to Ontario. That's for sure"
  },
  {
    "text" : " Great question Sumit an open work permit hold to do Alberta job offers need to be supported by LMIA's at this stage",
    "endMs" : 3665920,
    "startMs" : 3657020
  },
  {
    "startMs" : 3665920,
    "text" : " The answer is no it could change in the future. But at this stage the answer is no",
    "endMs" : 3669860
  },
  {
    "startMs" : 3669860,
    "text" : " See what else we have",
    "endMs" : 3673740
  },
  {
    "endMs" : 3680260,
    "text" : " Mark says so you don't have to pay the fee yet. If you're applying through the expression of interest, that's correct",
    "startMs" : 3675300
  },
  {
    "startMs" : 3680260,
    "endMs" : 3682260,
    "text" : " There's no fee to submit an expression of interest"
  },
  {
    "text" : " And mark just to confirm yes regardless of having two or three years",
    "startMs" : 3682260,
    "endMs" : 3689460
  },
  {
    "text" : " It doesn't matter based on the grid and as we indicate here if we slide back to the grid",
    "startMs" : 3689460,
    "endMs" : 3694060
  },
  {
    "startMs" : 3694060,
    "text" : " You can see for work experience here",
    "endMs" : 3696060
  },
  {
    "startMs" : 3696060,
    "endMs" : 3703220,
    "text" : " Once you hit you guys once you hit 12 or more months, then you've capped out. So anything more than that, you're not going to get"
  },
  {
    "text" : " Yeah, you're not going to get those extra points",
    "endMs" : 3706980,
    "startMs" : 3704220
  },
  {
    "endMs" : 3711000,
    "startMs" : 3706980,
    "text" : " Well bolt basically you've reached the maximum number of points"
  },
  {
    "text" : " Okay",
    "startMs" : 3711000,
    "endMs" : 3713960
  },
  {
    "endMs" : 3718860,
    "text" : " Okay, here we go",
    "startMs" : 3713960
  },
  {
    "endMs" : 3723540,
    "startMs" : 3718860,
    "text" : " Janelle says what if I have a master's degree at my home country and I finished a bachelor's degree in Alberta"
  },
  {
    "startMs" : 3723540,
    "endMs" : 3729300,
    "text" : " What would be my points in location? Okay. Well, let's take a look. We can always sort this out. So"
  },
  {
    "startMs" : 3730060,
    "endMs" : 3735260,
    "text" : " If we go back here, so it says here the highest level of education completed"
  },
  {
    "text" : " So the highest level of education completed 12, if you have a master's degree, you're gonna get 10 points here",
    "startMs" : 3735260,
    "endMs" : 3739860
  },
  {
    "startMs" : 3739860,
    "endMs" : 3745660,
    "text" : " Location of highest level of education completed in Canada. Well, that's a good question"
  },
  {
    "endMs" : 3752660,
    "startMs" : 3745660,
    "text" : " That's a really good question in this case here and understand. This is just a grid I would have to assume"
  },
  {
    "endMs" : 3761380,
    "text" : " Completed in another province or territory not Alberta. I don't know you would if you had a bachelor's degree right here",
    "startMs" : 3753980
  },
  {
    "endMs" : 3765380,
    "text" : " That's seven points. Then I have to assume that",
    "startMs" : 3761380
  },
  {
    "text" : " The highest level of education completed in Canada if you completed it in Alberta, let's just see where you indicated",
    "endMs" : 3772580,
    "startMs" : 3765380
  },
  {
    "startMs" : 3772580,
    "endMs" : 3778820,
    "text" : " It doesn't say Oh degree in Alberta, then I think you still should be able to get those points"
  },
  {
    "startMs" : 3780860,
    "endMs" : 3786260,
    "text" : " Yeah, it doesn't say it just says the location of the highest level of education completed in Canada"
  },
  {
    "endMs" : 3791020,
    "startMs" : 3786260,
    "text" : " So that would assume that your bachelor's degree if you took a bachelor's which is interesting"
  },
  {
    "startMs" : 3791020,
    "endMs" : 3795740,
    "text" : " That you'd still get those points if it was in Alberta. Okay"
  },
  {
    "endMs" : 3799320,
    "text" : " We'll keep zipping here. We're just about gonna wrap up here guys",
    "startMs" : 3795740
  },
  {
    "endMs" : 3806860,
    "startMs" : 3799320,
    "text" : " I don't want to go too late. It's already 837. We've been going for about an hour here. Okay, let's see what else we have"
  },
  {
    "text" : " Okay",
    "endMs" : 3811580,
    "startMs" : 3810340
  },
  {
    "endMs" : 3815580,
    "text" : " Danny says if I got a US working working experiences, the points will be added",
    "startMs" : 3811580
  },
  {
    "endMs" : 3819620,
    "startMs" : 3815580,
    "text" : " Well as you can see if we go back to the point grid and I think a lot of people's questions are going to be"
  },
  {
    "startMs" : 3819620,
    "endMs" : 3825340,
    "text" : " Related to this if we go to the work history, you can see that it includes all experience in Canada and abroad"
  },
  {
    "endMs" : 3827900,
    "text" : " So the answer for here is yes",
    "startMs" : 3825340
  },
  {
    "text" : " It's just these extra bonus points if you have worked in Canada",
    "endMs" : 3832700,
    "startMs" : 3827900
  },
  {
    "startMs" : 3832700,
    "endMs" : 3837420,
    "text" : " All right, what's next as we zip through"
  },
  {
    "text" : " You",
    "startMs" : 3838260,
    "endMs" : 3840260
  },
  {
    "startMs" : 3840260,
    "text" : " Okay, Brian says thank you for the job offer to be valid for AOS",
    "endMs" : 3844340
  },
  {
    "text" : " It must be with a closed work permit that that depends not all",
    "endMs" : 3848760,
    "startMs" : 3844340
  },
  {
    "startMs" : 3848760,
    "text" : " AOS",
    "endMs" : 3851260
  },
  {
    "text" : " Job offers or work experience have to be closed work permits",
    "startMs" : 3851260,
    "endMs" : 3855460
  },
  {
    "endMs" : 3863460,
    "startMs" : 3855460,
    "text" : " Like for example, the quit open work permit is is open and available a postgrad work permit for individuals who have studied in Alberta"
  },
  {
    "endMs" : 3866420,
    "text" : " They also can count that",
    "startMs" : 3863460
  },
  {
    "text" : " Can count that towards like that job offer now. Here's one thing. I want to point out",
    "startMs" : 3867020,
    "endMs" : 3872420
  },
  {
    "text" : " Okay, this is something that I could have said earlier, but these things kind of come to me",
    "startMs" : 3872420,
    "endMs" : 3876420
  },
  {
    "startMs" : 3876420,
    "endMs" : 3878420,
    "text" : " There's so much that I needed to talk about"
  },
  {
    "endMs" : 3885420,
    "startMs" : 3878420,
    "text" : " Here's a very very interesting aspect of this and I'm not sure if it's actually if it's stated in here or not"
  },
  {
    "endMs" : 3888260,
    "startMs" : 3885420,
    "text" : " Let's just see here. I don't know if it is"
  },
  {
    "startMs" : 3888260,
    "endMs" : 3893700,
    "text" : " Confirm you meet the requirements for one or more streams. Okay, let's just highlight this"
  },
  {
    "endMs" : 3898780,
    "startMs" : 3893700,
    "text" : " Okay, so we encourage you to take the following steps to prepare to submit a worker EOI confirm"
  },
  {
    "endMs" : 3902340,
    "startMs" : 3898780,
    "text" : " You meet eligibility requirements for one or more a AIP work streams"
  },
  {
    "endMs" : 3908060,
    "startMs" : 3902340,
    "text" : " So a couple things I can point out one is that you cannot submit more than one expression of interest at the same time"
  },
  {
    "endMs" : 3910660,
    "text" : " You can't do a worker and an entrepreneur one",
    "startMs" : 3908060
  },
  {
    "startMs" : 3910660,
    "text" : " It has to only one and if you have an old one and then you want to recreate a new one or make changes",
    "endMs" : 3916580
  },
  {
    "endMs" : 3918740,
    "startMs" : 3916580,
    "text" : " You cancel the other one and start a new one"
  },
  {
    "text" : " But here's the interesting part and I'm gonna go back here where everybody can see me",
    "startMs" : 3918740,
    "endMs" : 3923020
  },
  {
    "startMs" : 3923180,
    "text" : " The interesting part is that ultimately you are not the one that's choosing which program you're going through",
    "endMs" : 3929460
  },
  {
    "endMs" : 3934180,
    "text" : " When you start off you're gonna have an ability to explain to some extent",
    "startMs" : 3929460
  },
  {
    "endMs" : 3940860,
    "startMs" : 3934180,
    "text" : " You know you there's always gonna be an ability to to you know to"
  },
  {
    "startMs" : 3940860,
    "endMs" : 3946340,
    "text" : " To you know decide which program you're eligible for because that's what it says right here on the sheet"
  },
  {
    "text" : " It says you need to determine I'm trying not to I don't want to say anything that discloses anything that would have",
    "startMs" : 3946340,
    "endMs" : 3952380
  },
  {
    "endMs" : 3958140,
    "text" : " You know been under the the non-disclosure agreement, but ultimately you yeah when it comes to eligibility",
    "startMs" : 3952380
  },
  {
    "startMs" : 3958140,
    "endMs" : 3965860,
    "text" : " The Alberta advantage immigration program is always going to be the one that has the final decision on which program you're nominated under and that's always"
  },
  {
    "text" : " Been the case. There's no there's nothing different about that",
    "endMs" : 3968900,
    "startMs" : 3965860
  },
  {
    "startMs" : 3968900,
    "endMs" : 3975500,
    "text" : " So you're gonna submit your expression of interest and then they're going to determine where you're gonna go and which one you're gonna qualify through"
  },
  {
    "text" : " Okay, let's see here",
    "startMs" : 3975500,
    "endMs" : 3978140
  },
  {
    "endMs" : 3986180,
    "text" : " Just trying to find anything that I have not yet otherwise answered from other people if I skip through like don't worry about that",
    "startMs" : 3979540
  },
  {
    "endMs" : 3989620,
    "startMs" : 3986180,
    "text" : " Okay"
  },
  {
    "startMs" : 3989620,
    "endMs" : 3991620,
    "text" : " Beza says I have a TS"
  },
  {
    "text" : " 2023 open work permit I live in Alberta and have been working here for seven months",
    "startMs" : 3991620,
    "endMs" : 3996420
  },
  {
    "text" : " Can I also be included in this program? Well, everybody can you can absolutely submit an expression of interest?",
    "startMs" : 3996420,
    "endMs" : 4002260
  },
  {
    "text" : " Okay, Tash says do you think co-op work experience in Alberta will count?",
    "startMs" : 4002260,
    "endMs" : 4007140
  },
  {
    "endMs" : 4009140,
    "startMs" : 4007140,
    "text" : " I personally don't think it will"
  },
  {
    "startMs" : 4009220,
    "endMs" : 4016020,
    "text" : " But we'll see. I don't I don't know if they will have the same restriction on work experience gained while studying"
  },
  {
    "text" : " I don't know, but I have to assume it's probably going to maintain the same thing",
    "endMs" : 4020860,
    "startMs" : 4016020
  },
  {
    "startMs" : 4020860,
    "text" : " Once again, Giselle says what about who is working in a hospital? They're on a part-time full-time. Does that mean it's not counted?",
    "endMs" : 4030700
  },
  {
    "startMs" : 4030700,
    "endMs" : 4033220,
    "text" : " I don't know what that means part-time full-time"
  },
  {
    "endMs" : 4037660,
    "startMs" : 4033220,
    "text" : " 30 hours per week is kind of the the minimum"
  },
  {
    "text" : " Okay, Moe is from Merzouga",
    "startMs" : 4038460,
    "endMs" : 4040460
  },
  {
    "endMs" : 4048300,
    "text" : " Okay, Beza as well at this stage there in terms of the expression of interest",
    "startMs" : 4040460
  },
  {
    "endMs" : 4053820,
    "text" : " There's going to be different points depending upon foreign work experience Canadian work experience",
    "startMs" : 4048300
  },
  {
    "startMs" : 4053820,
    "endMs" : 4057180,
    "text" : " Excuse me, but"
  },
  {
    "text" : " within each of the programs the Alberta opportunity stream",
    "startMs" : 4057180,
    "endMs" : 4060140
  },
  {
    "endMs" : 4063340,
    "text" : " There are restrictions on the kinds of work permits for that program",
    "startMs" : 4060140
  },
  {
    "endMs" : 4070740,
    "startMs" : 4063340,
    "text" : " but other programs like for example the accelerated tech pathway, which you if you have work experience in that category or rural renewal stream"
  },
  {
    "text" : " Doesn't necessarily require that you have a work permit. So that's why I can't say, you know",
    "startMs" : 4070740,
    "endMs" : 4075540
  },
  {
    "endMs" : 4079700,
    "startMs" : 4075540,
    "text" : " No, it doesn't matter because the expression of interest doesn't require it"
  },
  {
    "text" : " You always have to look at the underlying programs because the eligibility for those programs are the thing that's going to allow you to advance",
    "startMs" : 4079700,
    "endMs" : 4086020
  },
  {
    "startMs" : 4086020,
    "endMs" : 4092100,
    "text" : " To the next step. It's not just all about scoring the highest expression of interest points under your work experience"
  },
  {
    "endMs" : 4097100,
    "text" : " It's all about looking at the underlying programs. So it's not just about scoring a high expression of interest",
    "startMs" : 4092100
  },
  {
    "endMs" : 4101220,
    "text" : " It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4097100
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4101220,
    "endMs" : 4106060
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4106060,
    "endMs" : 4110580
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4114860,
    "startMs" : 4110580
  },
  {
    "endMs" : 4118860,
    "startMs" : 4114860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4122860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4118860
  },
  {
    "endMs" : 4126860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4122860
  },
  {
    "startMs" : 4126860,
    "endMs" : 4130860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4134860,
    "startMs" : 4130860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4134860,
    "endMs" : 4138860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4138860,
    "endMs" : 4142860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4142860,
    "endMs" : 4146860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4150860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4146860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4150860,
    "endMs" : 4154860
  },
  {
    "endMs" : 4158860,
    "startMs" : 4154860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4162860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4158860
  },
  {
    "startMs" : 4162860,
    "endMs" : 4166860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4166860,
    "endMs" : 4170860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4170860,
    "endMs" : 4174860
  },
  {
    "startMs" : 4174860,
    "endMs" : 4178860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4178860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4182860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4182860,
    "endMs" : 4186860
  },
  {
    "startMs" : 4186860,
    "endMs" : 4190860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4190860,
    "endMs" : 4194860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4198860,
    "startMs" : 4194860
  },
  {
    "startMs" : 4198860,
    "endMs" : 4202860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4206860,
    "startMs" : 4202860
  },
  {
    "endMs" : 4210860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4206860
  },
  {
    "startMs" : 4210860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4214860
  },
  {
    "startMs" : 4214860,
    "endMs" : 4218860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4218860,
    "endMs" : 4222860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4222860,
    "endMs" : 4226860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4226860,
    "endMs" : 4230860
  },
  {
    "startMs" : 4230860,
    "endMs" : 4234860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4238860,
    "startMs" : 4234860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4238860,
    "endMs" : 4242860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4242860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4246860
  },
  {
    "endMs" : 4250860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4246860
  },
  {
    "endMs" : 4254860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4250860
  },
  {
    "endMs" : 4258860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4254860
  },
  {
    "endMs" : 4262860,
    "startMs" : 4258860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4266860,
    "startMs" : 4262860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4270860,
    "startMs" : 4266860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4270860,
    "endMs" : 4274860
  },
  {
    "endMs" : 4278860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4274860
  },
  {
    "startMs" : 4278860,
    "endMs" : 4282860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4282860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4286860
  },
  {
    "endMs" : 4290860,
    "startMs" : 4286860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4290860,
    "endMs" : 4294860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4298860,
    "startMs" : 4294860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4298860,
    "endMs" : 4302860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4302860,
    "endMs" : 4306860
  },
  {
    "startMs" : 4306860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4310860
  },
  {
    "startMs" : 4310860,
    "endMs" : 4314860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4318860,
    "startMs" : 4314860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4322860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4318860
  },
  {
    "startMs" : 4322860,
    "endMs" : 4326860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4326860,
    "endMs" : 4330860
  },
  {
    "endMs" : 4334860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4330860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4334860,
    "endMs" : 4338860
  },
  {
    "startMs" : 4338860,
    "endMs" : 4342860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4342860,
    "endMs" : 4346860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4346860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4350860
  },
  {
    "startMs" : 4350860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4354860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4354860,
    "endMs" : 4358860
  },
  {
    "endMs" : 4362860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4358860
  },
  {
    "endMs" : 4366860,
    "startMs" : 4362860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4370860,
    "startMs" : 4366860
  },
  {
    "endMs" : 4374860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4370860
  },
  {
    "endMs" : 4378860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4374860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4378860,
    "endMs" : 4382860
  },
  {
    "startMs" : 4382860,
    "endMs" : 4386860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4386860,
    "endMs" : 4390860
  },
  {
    "startMs" : 4390860,
    "endMs" : 4394860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4398860,
    "startMs" : 4394860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4402860,
    "startMs" : 4398860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4402860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4406860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4406860,
    "endMs" : 4410860
  },
  {
    "startMs" : 4410860,
    "endMs" : 4414860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4418860,
    "startMs" : 4414860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4422860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4418860
  },
  {
    "endMs" : 4426860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4422860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4430860,
    "startMs" : 4426860
  },
  {
    "startMs" : 4430860,
    "endMs" : 4434860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4434860,
    "endMs" : 4438860
  },
  {
    "startMs" : 4438860,
    "endMs" : 4442860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4442860,
    "endMs" : 4446860
  },
  {
    "startMs" : 4446860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4450860
  },
  {
    "endMs" : 4454860,
    "startMs" : 4450860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4454860,
    "endMs" : 4458860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4462860,
    "startMs" : 4458860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4466860,
    "startMs" : 4462860
  },
  {
    "startMs" : 4466860,
    "endMs" : 4470860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4474860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4470860
  },
  {
    "endMs" : 4478860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4474860
  },
  {
    "startMs" : 4478860,
    "endMs" : 4482860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4482860,
    "endMs" : 4486860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4486860,
    "endMs" : 4490860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4490860,
    "endMs" : 4494860
  },
  {
    "endMs" : 4498860,
    "startMs" : 4494860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4498860,
    "endMs" : 4502860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4502860,
    "endMs" : 4506860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4506860,
    "endMs" : 4510860
  },
  {
    "startMs" : 4510860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4514860
  },
  {
    "startMs" : 4514860,
    "endMs" : 4518860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4522860,
    "startMs" : 4518860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4522860,
    "endMs" : 4526860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4526860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4530860
  },
  {
    "endMs" : 4534860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4530860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4538860,
    "startMs" : 4534860
  },
  {
    "endMs" : 4542860,
    "startMs" : 4538860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4546860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4542860
  },
  {
    "startMs" : 4546860,
    "endMs" : 4550860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4550860,
    "endMs" : 4554860
  },
  {
    "endMs" : 4558860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4554860
  },
  {
    "startMs" : 4558860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4562860
  },
  {
    "endMs" : 4566860,
    "startMs" : 4562860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4570860,
    "startMs" : 4566860
  },
  {
    "endMs" : 4574860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4570860
  },
  {
    "endMs" : 4578860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4574860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4578860,
    "endMs" : 4582860
  },
  {
    "startMs" : 4582860,
    "endMs" : 4586860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4590860,
    "startMs" : 4586860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4594860,
    "startMs" : 4590860
  },
  {
    "startMs" : 4594860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4598860
  },
  {
    "startMs" : 4598860,
    "endMs" : 4602860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4602860,
    "endMs" : 4606860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4610860,
    "startMs" : 4606860
  },
  {
    "endMs" : 4614860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4610860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4614860,
    "endMs" : 4618860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4618860,
    "endMs" : 4622860
  },
  {
    "startMs" : 4622860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4626860
  },
  {
    "startMs" : 4626860,
    "endMs" : 4630860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4634860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4630860
  },
  {
    "startMs" : 4634860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4638860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4642860,
    "startMs" : 4638860
  },
  {
    "startMs" : 4642860,
    "endMs" : 4646860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4646860,
    "endMs" : 4650860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4654860,
    "startMs" : 4650860
  },
  {
    "startMs" : 4654860,
    "endMs" : 4658860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4662860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4658860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4662860,
    "endMs" : 4666860
  },
  {
    "startMs" : 4666860,
    "endMs" : 4670860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4670860,
    "endMs" : 4674860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4674860,
    "endMs" : 4678860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4682860,
    "startMs" : 4678860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4686860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4682860
  },
  {
    "startMs" : 4686860,
    "endMs" : 4690860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4694860,
    "startMs" : 4690860
  },
  {
    "endMs" : 4698860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4694860
  },
  {
    "startMs" : 4698860,
    "endMs" : 4702860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4702860,
    "endMs" : 4706860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4706860,
    "endMs" : 4710860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4714860,
    "startMs" : 4710860
  },
  {
    "endMs" : 4718860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4714860
  },
  {
    "startMs" : 4718860,
    "endMs" : 4722860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4722860,
    "endMs" : 4726860
  },
  {
    "endMs" : 4730860,
    "startMs" : 4726860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4734860,
    "startMs" : 4730860
  },
  {
    "endMs" : 4738860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4734860
  },
  {
    "startMs" : 4738860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4742860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4746860,
    "startMs" : 4742860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4746860,
    "endMs" : 4750860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4750860,
    "endMs" : 4754860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4758860,
    "startMs" : 4754860
  },
  {
    "endMs" : 4762860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4758860
  },
  {
    "startMs" : 4762860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4766860
  },
  {
    "startMs" : 4766860,
    "endMs" : 4770860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4770860,
    "endMs" : 4774860
  },
  {
    "startMs" : 4774860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4778860
  },
  {
    "startMs" : 4778860,
    "endMs" : 4782860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4782860,
    "endMs" : 4786860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4790860,
    "startMs" : 4786860
  },
  {
    "startMs" : 4790860,
    "endMs" : 4794860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4794860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4798860
  },
  {
    "startMs" : 4798860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4802860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4802860,
    "endMs" : 4806860
  },
  {
    "startMs" : 4806860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4810860
  },
  {
    "endMs" : 4814860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4810860
  },
  {
    "endMs" : 4818860,
    "startMs" : 4814860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4818860,
    "endMs" : 4822860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4822860,
    "endMs" : 4826860
  },
  {
    "startMs" : 4826860,
    "endMs" : 4830860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4830860,
    "endMs" : 4834860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4834860,
    "endMs" : 4838860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4842860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4838860
  },
  {
    "startMs" : 4842860,
    "endMs" : 4846860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4850860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4846860
  },
  {
    "endMs" : 4854860,
    "startMs" : 4850860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4858860,
    "startMs" : 4854860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4858860,
    "endMs" : 4862860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4866860,
    "startMs" : 4862860
  },
  {
    "startMs" : 4866860,
    "endMs" : 4870860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4874860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4870860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4874860,
    "endMs" : 4878860
  },
  {
    "endMs" : 4882860,
    "startMs" : 4878860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4886860,
    "startMs" : 4882860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4886860,
    "endMs" : 4890860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4890860,
    "endMs" : 4894860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4898860,
    "startMs" : 4894860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4902860,
    "startMs" : 4898860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4902860,
    "endMs" : 4906860
  },
  {
    "startMs" : 4906860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4910860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4910860,
    "endMs" : 4914860
  },
  {
    "startMs" : 4914860,
    "endMs" : 4918860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4922860,
    "startMs" : 4918860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4922860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4926860
  },
  {
    "startMs" : 4926860,
    "endMs" : 4930860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4934860,
    "startMs" : 4930860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4934860,
    "endMs" : 4938860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4938860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4942860
  },
  {
    "endMs" : 4946860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4942860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4950860,
    "startMs" : 4946860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4950860,
    "endMs" : 4954860
  },
  {
    "startMs" : 4954860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4958860
  },
  {
    "startMs" : 4958860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4962860
  },
  {
    "endMs" : 4966860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4962860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4970860,
    "startMs" : 4966860
  },
  {
    "startMs" : 4970860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4974860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 4978860,
    "startMs" : 4974860
  },
  {
    "endMs" : 4982860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4978860
  },
  {
    "startMs" : 4982860,
    "endMs" : 4986860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 4986860,
    "endMs" : 4990860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 4994860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4990860
  },
  {
    "endMs" : 4998860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 4994860
  },
  {
    "startMs" : 4998860,
    "endMs" : 5002860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5002860,
    "endMs" : 5006860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5006860,
    "endMs" : 5010860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5010860,
    "endMs" : 5014860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5014860,
    "endMs" : 5018860
  },
  {
    "endMs" : 5022860,
    "startMs" : 5018860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5026860,
    "startMs" : 5022860
  },
  {
    "startMs" : 5026860,
    "endMs" : 5030860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5034860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5030860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5034860,
    "endMs" : 5038860
  },
  {
    "startMs" : 5038860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5042860
  },
  {
    "startMs" : 5042860,
    "endMs" : 5046860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5046860,
    "endMs" : 5050860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5054860,
    "startMs" : 5050860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5054860,
    "endMs" : 5058860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5058860,
    "endMs" : 5062860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5062860,
    "endMs" : 5066860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5066860,
    "endMs" : 5070860
  },
  {
    "startMs" : 5070860,
    "endMs" : 5074860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5078860,
    "startMs" : 5074860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5082860,
    "startMs" : 5078860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5082860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5086860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5090860,
    "startMs" : 5086860
  },
  {
    "startMs" : 5090860,
    "endMs" : 5094860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5098860,
    "startMs" : 5094860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5098860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5102860
  },
  {
    "endMs" : 5106860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5102860
  },
  {
    "endMs" : 5110860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5106860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5110860,
    "endMs" : 5114860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5114860,
    "endMs" : 5118860
  },
  {
    "endMs" : 5122860,
    "startMs" : 5118860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5126860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5122860
  },
  {
    "startMs" : 5126860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5130860
  },
  {
    "endMs" : 5134860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5130860
  },
  {
    "startMs" : 5134860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5138860
  },
  {
    "endMs" : 5142860,
    "startMs" : 5138860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5146860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5142860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5146860,
    "endMs" : 5150860
  },
  {
    "endMs" : 5154860,
    "startMs" : 5150860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5154860,
    "endMs" : 5158860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5162860,
    "startMs" : 5158860
  },
  {
    "startMs" : 5162860,
    "endMs" : 5166860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5170860,
    "startMs" : 5166860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5170860,
    "endMs" : 5174860
  },
  {
    "startMs" : 5174860,
    "endMs" : 5178860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5178860,
    "endMs" : 5182860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5182860,
    "endMs" : 5186860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5190860,
    "startMs" : 5186860
  },
  {
    "endMs" : 5194860,
    "startMs" : 5190860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5198860,
    "startMs" : 5194860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5198860,
    "endMs" : 5202860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5206860,
    "startMs" : 5202860
  },
  {
    "startMs" : 5206860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5210860
  },
  {
    "endMs" : 5214860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5210860
  },
  {
    "endMs" : 5218860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5214860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5218860,
    "endMs" : 5222860
  },
  {
    "endMs" : 5226860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5222860
  },
  {
    "endMs" : 5230860,
    "startMs" : 5226860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5230860,
    "endMs" : 5234860
  },
  {
    "startMs" : 5234860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5238860
  },
  {
    "startMs" : 5238860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5242860
  },
  {
    "startMs" : 5242860,
    "endMs" : 5246860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5246860,
    "endMs" : 5250860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5254860,
    "startMs" : 5250860
  },
  {
    "startMs" : 5254860,
    "endMs" : 5258860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5262860,
    "startMs" : 5258860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5266860,
    "startMs" : 5262860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5266860,
    "endMs" : 5270860
  },
  {
    "endMs" : 5274860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5270860
  },
  {
    "startMs" : 5274860,
    "endMs" : 5278860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5282860,
    "startMs" : 5278860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5282860,
    "endMs" : 5286860
  },
  {
    "endMs" : 5290860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5286860
  },
  {
    "startMs" : 5290860,
    "endMs" : 5294860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5294860,
    "endMs" : 5298860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5302860,
    "startMs" : 5298860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5302860,
    "endMs" : 5306860
  },
  {
    "endMs" : 5310860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5306860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5310860,
    "endMs" : 5314860
  },
  {
    "endMs" : 5318860,
    "startMs" : 5314860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5322860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5318860
  },
  {
    "startMs" : 5322860,
    "endMs" : 5326860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5330860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5326860
  },
  {
    "startMs" : 5330860,
    "endMs" : 5334860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5334860,
    "endMs" : 5338860
  },
  {
    "startMs" : 5338860,
    "endMs" : 5342860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5342860,
    "endMs" : 5346860
  },
  {
    "startMs" : 5346860,
    "endMs" : 5350860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5350860,
    "endMs" : 5354860
  },
  {
    "startMs" : 5354860,
    "endMs" : 5358860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5362860,
    "startMs" : 5358860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5366860,
    "startMs" : 5362860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5366860,
    "endMs" : 5370860
  },
  {
    "endMs" : 5374860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5370860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5374860,
    "endMs" : 5378860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5382860,
    "startMs" : 5378860
  },
  {
    "endMs" : 5386860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5382860
  },
  {
    "endMs" : 5390860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5386860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5390860,
    "endMs" : 5394860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5394860,
    "endMs" : 5398860
  },
  {
    "endMs" : 5402860,
    "startMs" : 5398860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5402860,
    "endMs" : 5406860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5406860,
    "endMs" : 5410860
  },
  {
    "startMs" : 5410860,
    "endMs" : 5414860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5418860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5414860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5418860,
    "endMs" : 5422860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5422860,
    "endMs" : 5426860
  },
  {
    "endMs" : 5430860,
    "startMs" : 5426860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5434860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5430860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5434860,
    "endMs" : 5438860
  },
  {
    "endMs" : 5442860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5438860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5442860,
    "endMs" : 5446860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5450860,
    "startMs" : 5446860
  },
  {
    "startMs" : 5450860,
    "endMs" : 5454860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5458860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5454860
  },
  {
    "endMs" : 5462860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5458860
  },
  {
    "endMs" : 5466860,
    "startMs" : 5462860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5466860,
    "endMs" : 5470860
  },
  {
    "startMs" : 5470860,
    "endMs" : 5474860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5474860,
    "endMs" : 5478860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5478860,
    "endMs" : 5482860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5486860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5482860
  },
  {
    "startMs" : 5486860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5490860
  },
  {
    "endMs" : 5494860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5490860
  },
  {
    "endMs" : 5498860,
    "startMs" : 5494860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5498860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5502860
  },
  {
    "startMs" : 5502860,
    "endMs" : 5506860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5510860,
    "startMs" : 5506860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5514860,
    "startMs" : 5510860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5514860,
    "endMs" : 5518860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5518860,
    "endMs" : 5522860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5526860,
    "startMs" : 5522860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5530860,
    "startMs" : 5526860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5530860,
    "endMs" : 5534860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5538860,
    "startMs" : 5534860
  },
  {
    "startMs" : 5538860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5542860
  },
  {
    "endMs" : 5546860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5542860
  },
  {
    "startMs" : 5546860,
    "endMs" : 5550860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5550860,
    "endMs" : 5554860
  },
  {
    "startMs" : 5554860,
    "endMs" : 5558860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5562860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5558860
  },
  {
    "startMs" : 5562860,
    "endMs" : 5566860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5570860,
    "startMs" : 5566860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5570860,
    "endMs" : 5574860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5574860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5578860
  },
  {
    "startMs" : 5578860,
    "endMs" : 5582860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5586860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5582860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5590860,
    "startMs" : 5586860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5594860,
    "startMs" : 5590860
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5598860,
    "startMs" : 5594860
  },
  {
    "endMs" : 5602860,
    "startMs" : 5598860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5606860,
    "startMs" : 5602860
  },
  {
    "startMs" : 5606860,
    "endMs" : 5610860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5610860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5614860
  },
  {
    "endMs" : 5618860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "startMs" : 5614860
  },
  {
    "startMs" : 5618860,
    "endMs" : 5622860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "endMs" : 5626860,
    "startMs" : 5622860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step"
  },
  {
    "startMs" : 5626860,
    "text" : " So it's not just about scoring a high expression of interest. It's about looking at the underlying programs that are going to allow you to advance to the next step",
    "endMs" : 5630860
  },
  {
    "endMs" : 5633000,
    "text" : " take care and have a wonderful evening.",
    "startMs" : 5630860
  }
]